[
  {
    "projectId": "2f490492-cc7f-41bb-8081-7056289f66ed",
    "requirements": "---\n\n# Context Document: 4. Project Intake System Replacement – Detailed Specification.docx\n\nProject Intake System Replacement – Detailed Specification\nBackground and Problem Statement\nOchsner Health’s current project and vendor request intake process relies on a third-party tool (ProcessUnity) that has proven to be a poor fit. Employees who want to propose new project ideas or vendor requests find the existing tool unintuitive and cumbersome. This results in frustration, incomplete submissions, and potentially fewer ideas being formally proposed. In effect, the “front door” for new initiatives is not welcoming – it’s hard to navigate and requires significant effort to submit requests. As a consequence, important project ideas may fall through the cracks, and the leadership lacks confidence that they are seeing all viable proposals.\nThe current system also incurs high licensing and maintenance costs for functionality that should be straightforward. This drains budget that could be better used elsewhere. Moreover, once a request is submitted, there is a lack of transparency in the approval process. Requesters often cannot easily determine the status of their submission or who is reviewing it without digging into the unfriendly tool interface. In plain terms, the intake process is chaotic and opaque. This can slow down innovation (if proposing a project is too difficult, people will simply stop trying) and can lead to suboptimal decisions – projects might be approved without a strong business case, while high-value ideas might be overlooked due to poor initial justification.\nOverall, the pain is felt across the board: employees dislike the hassle of using the current system, and leadership isn’t getting the quality information or oversight needed. With too little upfront information or guidance, projects can be approved that don’t align with strategy or fail to deliver real value[1]. An ineffective intake process ultimately means wasted resources on low-impact projects and missed opportunities for high-impact ones.\nGoals and Objectives\nThe primary goal of this initiative is to replace the existing intake tool with a custom-built Project Intake System tailored to Ochsner’s needs, thereby addressing the pain points above. The new system will provide a streamlined, user-friendly experience for submitting and tracking project requests, while ensuring that leadership receives high-quality, consistent proposals for evaluation. Key objectives include:\nEnhance Usability and Adoption: Create an intuitive web-based intake portal that makes it painless for employees to submit new project or vendor requests[2]. A simpler process will encourage more innovation by removing friction.\nEnsure Strategic Alignment and Value: Guide users to provide necessary business case information (strategic alignment, expected benefits, cost estimates, etc.) so that each proposal clearly articulates its value. This will help prioritize the right work and reduce waste by focusing on ideas that support organizational goals[3].\nImprove Transparency: Implement a single, transparent list (dashboard) of all requests and their status, giving stakeholders a one-stop view of the project pipeline[4]. This “single pane of glass” ensures nothing falls through the cracks and that everyone can see where each idea stands.\nStreamline Workflow and Approvals: Define a clear intake and approval workflow with designated reviewers and decision points. The system will route requests to the appropriate leaders (e.g. PMO or governance committee) and track decisions (approve/hold/reject) with feedback. Open communication of decisions is key so that everyone is aware of outcomes and next steps[5].\nReduce Costs: Eliminate the licensing fees of the third-party tool by leveraging in-house technology (built on Azure). The custom solution avoids recurring vendor costs (estimated to save significant budget annually) while providing ownership to adapt the system as needs evolve.\nIntegrate for Efficiency: Ensure the new intake system can integrate with Ochsner’s existing IT ecosystem – from single sign-on for user authentication to potential linkage with systems like Epic and ServiceNow. This will enable seamless transitions (for example, approved ideas can be pushed into the execution system without manual re-entry) and leverage data from other sources to avoid duplicating solutions.\nBy achieving these objectives, Ochsner will have a modern intake process that encourages innovation, captures robust justifications for new initiatives, and provides leadership with visibility and control over the project portfolio.\nSolution Overview\nProposed Solution: Develop a custom Project &amp; Vendor Request Intake web application for Ochsner Health, hosted on Azure. This system will replace ProcessUnity and be fully tailored to Ochsner’s process and terminology. It will serve as a centralized portal where employees (across 48 hospitals and other units) can submit new project proposals or vendor requests, and where those requests are reviewed, tracked, and managed through to approval.\nThe solution will consist of a modern front-end user interface for form submission and dashboards, and a secure back-end with a database to store request data and workflow status. The application will integrate with Ochsner’s Single Sign-On (SSO) for authentication, so that any employee with proper credentials can access the intake form and so that submissions are tied to the user’s identity automatically.\nOnce a request is submitted, the system will support an end-to-end workflow: initial triage, review by the relevant committee or approvers, and final disposition. Throughout this process, requesters and stakeholders can view the status of the request on a dashboard. The system will send notifications (e.g. emails or in-app alerts) at key stages to keep everyone informed.\nCrucially, the intake form will be designed not just to collect data, but to improve the quality of proposals. It will include guided sections to ensure the requester provides all needed information for evaluation – such as the project’s alignment to strategic objectives, expected ROI or benefits, costs, and any known alternatives. The system may also incorporate an “intelligent scan” feature to help identify if similar solutions exist internally or in the market (preventing redundancy). For example, if a user proposes a “new appointment reminder system,” the tool could prompt that an Epic module or an existing vendor solution might cover this need.\nThe new intake system will also feature built-in reporting and analytics capabilities. Leadership and PMO will be able to generate reports on demand (or view real-time charts) showing metrics like the number of requests submitted over time, approvals vs rejections, average evaluation times, and categorization of requests by strategic goal or department. This data will support continuous improvement of the intake process and portfolio planning.\nIn summary, the solution is a user-friendly, intelligent intake portal that will strengthen how Ochsner captures and vets new initiatives. It ensures each idea is documented with a strong business case, checks that the idea is novel or justified, and provides full visibility into the intake pipeline from submission to approval.\nKey Features and Functional Requirements\nBelow are the major features and functional requirements of the proposed intake system:\n1. Modern User-Friendly Submission Form\nIntuitive Web Interface: A clean, easy-to-navigate web form for submitting project or vendor requests. The interface should be accessible via standard browsers and mobile-friendly if possible. It must be simple enough that employees with no special training can use it on first try.\nSingle Sign-On (SSO) Integration: Users will authenticate via Ochsner’s Azure Active Directory (or relevant SSO) to access the form. This ensures that submissions are tied to the user’s identity (auto-capturing the requester’s name, department, etc.) and that only authorized internal users can submit requests.\nGuided Input Fields: The form will capture all required information for a new initiative in a structured way. Fields will include:\nProject Title – A short name for the proposed project or request.\nDescription of the Idea/Request – A detailed description of what is being proposed and the problem it aims to solve.\nBusiness Objective / Strategic Alignment – The requester must select or specify which strategic goal or organizational priority this initiative supports (e.g. “Improve patient experience”, “Increase operational efficiency”, etc.). Ensuring proposals are linked to business objectives is a best practice for intake.\nExpected Benefits/Value – A description of the expected benefits, outcomes, or ROI. This might include qualitative benefits (e.g. improved patient satisfaction) and quantitative estimates (e.g. projected cost savings or revenue increase). The form may prompt for specific metrics (e.g. “Estimated annual cost savings in USD”). Requiring an articulation of value and ROI helps leadership make informed decisions.\nEstimated Costs – An initial rough estimate of the cost or resources required (if known). This could be a dollar range or effort estimate, to gauge scale.\nUrgency/Priority – The requester can indicate if the need is time-sensitive or tied to a regulatory deadline, etc.\nDepartment/Stakeholders – Which department or business unit is requesting this (auto-filled if possible from user’s profile) and any other stakeholders or sponsors involved.\nAttachments – Ability to upload supporting documents (e.g. a slide deck or business case document, if the requester has one).\nExisting Solutions Considered – A field to note if the requester is aware of any existing internal system or vendor product that was considered. (This nudges the user to do some due diligence before submitting.)\nDynamic Help and Templates: The form will include help text or tooltips for key fields to guide users on how to answer effectively. For example, next to “Expected Benefits,” a tooltip might say: “Describe how this will create value (e.g. improve patient outcomes, save cost, generate revenue). Be as specific as possible, e.g. ‘Reduce manual work by 20% leading to $X savings per year.’” This guidance is aimed at strengthening the business case content at submission time. The system might also provide examples or a template for answers (e.g. a template business case structure).\nProgressive Disclosure: To avoid overwhelming users with one huge form, the intake form might be broken into sections or steps (e.g. Step 1: Basic Info, Step 2: Impact and Alignment, Step 3: Cost and Alternatives). This keeps the interface clean and encourages completion.\nSave Draft Capability: Users should be able to save a draft of their request and come back to finish it later. Given that gathering all required info (like cost estimates or stakeholder approvals) might take time, this feature will improve completion rates.\nValidation and Required Fields: The system will enforce that all mandatory fields (like Title, Description, Strategic Alignment, Expected Benefits, etc.) are filled before allowing submission. If a user tries to submit without key info, it will highlight what’s missing. This ensures completeness and consistency – having a consistent format for proposals allows fair evaluation and comparison[6].\nUser-Friendly Experience: Throughout the form, the emphasis is on ease of use – minimal clicks, clear labels, and no extraneous complexity. The goal is that submitting a proposal should take only a few minutes for a well-prepared user. The design will follow web accessibility standards and Ochsner’s UX guidelines. By making it simple and even “painless for the requester to input data”[2], we expect higher adoption and more high-quality submissions.\n2. Strengthened Business Case Input and Guidance\nStrategic Alignment Enforcement: As noted, the form requires linking each request to Ochsner’s strategic objectives. This might be implemented as a dropdown menu of current strategic pillars (e.g. “Digital Medicine Expansion”, “Patient Experience Excellence”, “Operational Efficiency”, etc.) with an optional text for details. This ensures requesters consciously think about alignment. Leadership can later filter or sort requests by these alignments.\nValue and ROI Prompts: The system will encourage users to quantify benefits. For instance, if a user selects a benefit category (“cost savings”), an additional field could prompt “Approximate annual savings (in $ or FTE hours)”. If they select “revenue growth”, prompt for how much revenue or how it drives growth. These inputs help build a rough ROI (e.g. compare estimated benefits vs. costs) which can be displayed to approvers. While precise numbers may not always be available, even rough estimates focus the requester on the project’s business value.\nAuto-Calculations: The form can perform simple calculations or checks – for example, if the user provides an estimated cost and benefit, calculate an ROI percentage or payback period and show it. This immediate feedback might encourage the requester to refine their numbers if the ROI looks weak. (This is an optional feature for MVP, but conceptually aligns with making the business case stronger.)\nBest Practice Tips: Inline with certain fields, the system may show tips drawn from PMO best practices. For example, when filling “Project Description”, a tip could appear: “A good project proposal clearly defines the problem and how your idea solves it. Mention who it impacts and the expected change.” For “Strategic Alignment,” a tip might remind: “Projects aligned to strategic goals are more likely to be approved[7]. Select the goal that this initiative supports and briefly explain the connection.” These tips can be informed by internal guidelines or general intake best practices.\nRequired Justification for Large Requests: If a request is above certain thresholds (for example, expected cost &gt; $500k or cross-department impact), the form could dynamically reveal extra required fields, such as a more detailed risk assessment or requiring VP sponsor name. This ensures big initiatives have commensurate detail.\nConsistency and Completeness Checks: By structuring the input, we ensure each proposal has the key components of a business case. This uniformity allows the PMO and leadership to evaluate proposals side-by-side using predefined criteria[6]. The system, in effect, enforces a template that every requester follows, reducing the chances of approving poorly defined projects or missing critical information.\nThis focus on thorough and aligned business cases means leadership will receive higher-quality proposals. Over time, that leads to better project selection and outcomes – many organizations find that when intake is done thoroughly and tied to strategy, project success rates improve as low-value initiatives are filtered out early[1][7].\n3. Intelligent Internal/Market Scan for Redundancy\nDuplicate Detection: To avoid redundant projects (different people unknowingly requesting similar solutions), the system will include a mechanism to flag potential duplicates or overlaps. When a user enters the project title or description, the system can automatically search existing requests in the database for similar keywords. If a similar proposal was submitted recently, the user might see an alert: “Possible similar request: ‘Upgrade Appointment Reminder System’ submitted on 10/12/2025.” This allows the requester to reconsider or at least acknowledge the similarity in their submission. It also encourages collaboration (they might reach out to that requester or combine efforts).\nKnowledge Base Integration: We will maintain an internal knowledge base of known solutions and past projects. For example, a small library of entries like “Epic capability modules” or “Existing enterprise systems” and common vendor products in healthcare IT. The intake system’s intelligent scan can use the description text to match against this knowledge base. E.g., if someone writes “need a tool to send automated patient appointment reminders,” the system could return: “Recommendation: Ochsner’s existing system (Epic MyChart) has a module for appointment reminders – consider leveraging that before building new.” This feature might be implemented as a simple keyword match initially. In future, an AI/NLP component could analyze the request description and search documents or the web for similar solutions. The goal is to prevent approving projects that could be satisfied by existing capabilities, saving time and money.\nVetting Questions: In addition to automated scans, the form itself may ask the requester: “Have you checked if an existing internal system or vendor could solve this need? If yes, please describe why the existing solution doesn’t meet your needs.” Forcing an answer to this can prompt the requester to do a quick internal inquiry or research before submitting. As cited in best practices, having a gatekeeper or initial vetting can weed out duplicate or misaligned ideas early[8].\nIntake Coordinator Review: As part of the workflow (described later), an intake coordinator or admin role will manually review new submissions for obvious duplicates or existing solutions. They will have tools to merge duplicate requests or mark a submission as needing more research on available solutions. The system should allow linking related requests together (for example, flagging that Request #123 is similar to Request #110 and perhaps should be considered together or merged).\nOutcome of Scan: The results of any internal scan or coordinator notes will be visible to the approvers. For instance, a section in the request details might say: “Similar Solution Found: Epic’s Appointment Reminder (details…)” or “Duplicate Request: matches request ID 110 submitted by Dept X.” This information arms decision-makers with context to avoid green-lighting a redundant project or to direct the requester to an existing solution (possibly resulting in a quick win rather than a new project).\n(For the Minimum Viable Product, the intelligent scan can be rudimentary – e.g., a simple search and a manually maintained list of common tools. The concept, however, demonstrates an “intelligent intake” that leverages knowledge to avoid reinventing the wheel.)\n4. Workflow Management and Approval Process\nSubmission and Acknowledgment: Once a user submits the intake form, the system stores the request in a database and assigns it a unique Request ID. The requester should receive an immediate confirmation (on-screen and via email) that their idea was received, along with the Request ID and a summary of the submission.\nRouting to Reviewers: The system will determine the appropriate review path based on the type of request. For example:\nIT project requests might be routed to the IT Governance Committee or PMO for initial review.\nVendor/technology requests might notify the Supply Chain or IT vendor management team.\nDepartment-specific improvements might route to a departmental leadership queue.\n(These rules can be configured, but for MVP, a simple approach is: all requests go to a central PMO/Intake team first. They will then assign reviewers or committees as needed.) - Review &amp; Triage Stage: An intake coordinator or PMO analyst will first check the submission. They verify the form is complete and may add supplemental info (e.g., note potential duplicates or assign a category like “Clinical System” vs “Operational”). At this stage, they might also engage the requester for any clarifications (the system should allow adding comments back to the request). - Governance/Approval Stage: After initial triage, the request moves to a decision stage. The relevant decision-makers (could be a standing Intake Committee that meets regularly, or specific executives for certain categories) are notified that a new request is “Under Review”. They can log into the system to see the full request details and any PMO notes. - Decision Capture: The approvers have options to Approve, Reject, or Defer/Hold the request: - Approved for Further Action: This means the project is justified and should move forward into scoping or execution. The system will mark it as “Approved” and can trigger the next steps (such as creating a project entry in a project management tool – see integrations – or notifying relevant execution teams). - Rejected: This means the idea will not move forward (at least in its current form). The approver must provide a reason or feedback (e.g., “Duplicate of ongoing project X,” or “Business case not strong – ROI too low”). This feedback is recorded in the system. - Deferred/Hold: Neither an outright yes or no – perhaps the committee needs more information or wants to reconsider later. The request might be marked as “Pending” or “Need Info” and sent back to the requester or PMO for clarification. The system should allow looping back: e.g., the approver can request changes or more data, and the requester can update the submission or provide answers, then resubmit for review. - Multi-Level Approvals (if needed): For large projects, there might be multiple approval stages (e.g., initial approval by department head, then final approval by enterprise PMO or executive). The system should be flexible to support a multi-stage workflow. For now, a single approval stage is default, but the design will not preclude adding another (perhaps using a status like “Approved by Dept – Pending Executive Approval”). - Tracking and Audit Trail: Every action in the workflow is logged. This includes submission time, review assignments, status changes, and comments/feedback. This audit trail ensures accountability and makes it clear who decided what and when. It also helps if any request is questioned later; leadership can see the rationale recorded. - Notifications: The system will automatically send notifications at key points: - After submission (to requester confirmation, and to intake admins for a new request). - When a status changes (e.g., “Your project request has been approved” or “has been rejected/closed”). The notification will include any comments from approvers. - When more info is requested, the requester gets a notification to update their submission. - When an approved project is transitioned to execution, possibly notify the assigned project manager/team.\nThese notifications can be emails and/or in-system notifications (e.g., a notification bell icon in the app). Ensuring timely, transparent communication of decisions is critical so that contributors aren’t left in the dark[5]. - Dashboard for Approvers: Those in reviewer/approver roles will have a specialized view where they can see all pending requests awaiting their decision. This might be a list or queue with basic info (title, requester, submission date, and perhaps a priority score). Approvers can click into each to read details and then record their decision. This streamlines the review meetings or processes, as all needed information is at their fingertips in one system. - Configurable Workflow: Administrators of the system (likely the IT team building it, or PMO leads) should be able to adjust certain workflow settings. For example, adding a new status or changing who gets notified for certain categories. We may implement a simple rules engine or at least make some aspects configurable via an admin UI. This flexibility is important because Ochsner’s governance processes might change over time, and the tool should adapt without requiring a complete overhaul.\n5. Status Tracking and Transparency Dashboard\nRequester Dashboard: Each employee who submits an idea can later log into the intake system and see a personal dashboard of their submissions. For each request, it will display the current status (e.g. “Under Review by PMO”, “Approved – pending scheduling”, “Rejected – see feedback”), along with key dates (submission date, last update) and any reviewer comments. This addresses the current pain point of not knowing what happened after submission – now it’s clearly visible. The interface will make it easy for a requester to track their idea’s journey, fostering transparency and trust in the process.\nOverall Intake Pipeline View: A central dashboard will list all project/vendor requests in the system (or at least all active ones) with filters for status, department, strategic alignment, etc. This is the “single source of truth” for incoming work. Having one transparent list of all ideas being considered promotes stakeholder understanding and ensures nothing is off-the-record[9]. For example, leadership can see in one view all proposals submitted this quarter, and their statuses, instead of searching emails or disparate tools.\nVisualization of Stages: The dashboard can also present a visual indicator (like a progress bar or step markers) for each request, showing how far along it is in the process. E.g., a request might show “Stage: 3/5 – Under Executive Review” which corresponds to the defined workflow stages. This gives at-a-glance insight into pipeline health (e.g., many stuck in review, or many recently approved).\nAnalytics on Dashboard: We can incorporate summary statistics on the main dashboard. For instance, counters for “New Requests (past month)”, “Requests Under Review”, “Approved this year vs Rejected”, etc. A chart could show submissions trend over time. These provide a quick health check of the intake funnel and can highlight if there’s a bottleneck (e.g., if the number under review is very high, perhaps reviews are slow).\nDrill-down and Search: Users (with appropriate permissions) can search the list by keyword or filter by categories. This helps anyone (especially PMO or leadership) find if a certain idea has been proposed before. For instance, before submitting a new idea, an employee could search the repository to see if a similar idea exists – another way to reduce duplicates.\nSecurity/Visibility Controls: While transparency is important, we may restrict certain data to certain roles. For example, a normal employee might only see their own requests, while a department head might see all requests in their department, and PMO/leadership can see all requests organization-wide. The system will implement role-based view permissions to accommodate this. However, the default ethos is to make the intake list as open as possible within the organization to encourage collaboration and awareness.\nExport &amp; Reports: The data from the dashboard should be exportable (e.g., CSV or PDF report generation) so that it can be used in management meetings or further analysis. For example, generating a report of all proposals with their alignment and status for a quarterly portfolio review meeting. This saves manual work assembling such data.\nExample Dashboard Layout: (for illustration) The dashboard might have columns: Request ID, Title, Requester, Department, Submission Date, Status, and Alignment/Category. Each row is a request. At the top or side, filters can narrow the view. Clicking a request opens the full details and activity trail of that request.\nThis level of transparency is a major improvement over the current “black box” tool. It aligns with modern PMO best practices where a centralized intake list gives a holistic view of all proposed work, enabling better-informed decisions and ensuring no valuable idea is lost[10]. Stakeholders across Ochsner will be able to see (at least at a summary level) what initiatives are in the pipeline and how they’re progressing, which can also spur cross-department collaboration (e.g., two similar ideas from different hospitals might be noticed and combined).\n6. Notifications and Communication Features\nEmail Notifications: As mentioned under workflow, the system will send automated emails to relevant parties at key events. For example:\nTo intake admins: “New project request submitted by [Name] – Request #[ID]. Click here to review.”\nTo approvers: “Project Request [ID] is now awaiting your review.”\nTo requesters: “Your project request [ID] status changed to Approved” (with any comments or next steps included).\nTo requesters: “More information requested for your project [ID]. Please log in to update details.” These emails will contain links back to the system for convenience.\nIn-App Messaging: In addition to email, the system will have an in-app comments system or message center. Reviewers and requesters can post comments on a request (for example, an approver might ask a clarifying question: “Have we considered solution X for this?”). The requester would get notified and can reply in the system. This communication thread is stored with the request, creating a transparent dialogue.\nBroadcast Updates: The system could allow administrators to broadcast certain updates, e.g., “Intake process updated: new criteria added for digital projects” or “The intake portal will undergo maintenance on date Y.” This ensures users stay informed about the process itself.\nOpen Communication: By facilitating back-and-forth communication on each request and by notifying outcomes, the tool ensures no one is left wondering about the fate of their idea. This open communication and feedback loop is key to a successful intake process[5] – it keeps proposers engaged and educated on what happens to their ideas, and can provide learning for future submissions (especially if feedback is given on rejected ideas).\nStatus Change Explanations: Whenever a decision is made, the approver will be prompted to include a comment explaining the rationale (even if brief). These explanations are included in the notification to the requester. Over time, this builds understanding among staff on what types of proposals are likely to succeed. For instance, if several proposals are rejected with comments that they lack strategic alignment, employees will learn to ensure alignment in future suggestions.\nReminders and Escalations: The system can send reminder emails if a request has been sitting in a given status too long. For example, if a request is “Under Review” with a certain approver for over 2 weeks, an automated reminder goes to that approver (and maybe CC the PMO lead) saying “Request [ID] has been awaiting your decision for 14 days.” This helps prevent stagnation. Similarly, periodic summary emails to leadership (e.g., weekly digest of all new requests or status changes) can be configured.\nSubscription/Watch Feature: Users (especially leadership or committee members) might be able to “watch” certain requests or categories to get notified of any activity. For example, the CIO could subscribe to all requests marked as “Strategic Initiative” category to see what new ideas are coming in that area.\nIntegration with Collaboration Tools: As a future enhancement, notifications could also be sent to Microsoft Teams or other collaboration platforms used at Ochsner. For instance, a Teams channel for the PMO could receive a message whenever a new request is submitted. This real-time awareness can prompt quicker reviews and discussions.\nBy implementing robust communication features, the intake system not only logs data but also facilitates a conversation around each project idea. This ensures a culture of openness and continuous feedback, which strengthens the overall innovation process.\n7. Reporting and Analytics\nStandard Reports: The system will offer built-in reports to analyze the intake pipeline. Examples of reports:\nSubmission Volume: Number of requests submitted per month (trended over time). This can be used to gauge engagement and seasonality of ideas.\nApproval Rate: How many proposals get approved vs. rejected, possibly broken down by department or strategic category.\nAverage Processing Time: The average time a request spends from submission to final decision. This can highlight if the process is efficient or if there are bottlenecks.\nPortfolio Breakdown: A summary of all requests by status or by strategic alignment (e.g., 40% of proposed initiatives align with “Patient Experience”, 30% with “Operational Efficiency”, etc., perhaps shown as a pie chart).\nBenefits Forecast: Sum of all proposed benefits vs sum of proposed costs for approved projects (showing potential ROI of the pipeline).\nInteractive Dashboard (Analytics View): For PMO and leadership, an analytics section could provide interactive charts. For example, a graph of requests by department, or a timeline view of how projects move through stages. We could leverage a library or tool (like Power BI integration or Chart.js) for this visualization. Real-time analytics means as soon as data changes (a new submission or a decision), the charts update.\nCustom Queries: Advanced users or admins might build custom queries (or filters) and save them as reports. For instance, “Show me all Approved requests in the last 6 months with expected cost &gt; $100k and ROI &lt; 100%” – to identify potentially low-return projects that nonetheless were approved.\nExport to Excel/CSV: All report data should be exportable for offline analysis. Leadership often wants to slice the data in Excel or incorporate it into presentations.\nReporting Permissions: While the request list might be broadly visible, some analytics might be sensitive (e.g., seeing projected costs or ROI might be for leadership eyes only). We will implement permissions such that detailed financial or prioritization reports are accessible only to certain roles.\nBenefits Realization Tracking: Though beyond initial scope, the system could later incorporate tracking of actual outcomes. For example, after a project is executed, the PMO can update the record with actual achieved benefits vs. initial estimates. Reports can then show how accurate proposals were or the realized value. This closes the loop on the intake process, providing a feedback mechanism to improve future estimates (a known best practice is to have a feedback loop to evaluate if projects delivered as promised[11]).\nAudit Reports: The system will also allow auditing the process itself – e.g., list of all requests and who approved them, to ensure proper governance is followed. This is useful for internal audit or compliance reviews.\nDashboard Integration: Some key metrics from the reports can be displayed on the main dashboard (as mentioned before, like counts and simple charts). The full reporting section would allow deeper exploration and slicing/dicing of data.\nWith these analytics, Ochsner’s leadership can gain insights into the innovation pipeline and make data-driven decisions. For example, if the reports show that one strategic goal has dozens of proposals but another goal has few, that might spark discussions about encouraging ideas in under-represented areas. Or if the approval rate is very low in one department, maybe that department needs help formulating better proposals. Essentially, reporting turns the intake data into actionable intelligence, ensuring stakeholders stay up-to-date and can make better decisions, faster.\n8. Integration with Existing Systems\nTo maximize efficiency and eliminate manual work, the new intake system will integrate with several existing systems at Ochsner via APIs or other interfaces:\nSingle Sign-On (SSO) via Azure AD: As noted, the application will integrate with Azure Active Directory for authentication. Users will log in with their Ochsner credentials. This provides a seamless login experience (possibly automatically logged in if they are on the network) and ensures access control is centralized. Additionally, user profile information (name, department, email) can be pulled from AD to auto-populate parts of the request form and to route requests (e.g., knowing the requester’s department might tag the request with that department).\nIntegration with Epic (EHR System): Epic is a core clinical system at Ochsner. While Epic itself might not directly interface with a project intake tool, there are a few integration points to consider:\nThe knowledge base for the intelligent scan can include known Epic modules. We might integrate with Epic’s documentation or module list via an API or static reference to suggest existing Epic capabilities. For instance, if someone requests a feature that Epic provides, the intake system could flag that. In the future, a more advanced integration could query Epic (or an internal registry of Epic features) by keywords.\nIf a project request is related to Epic (e.g., “Implement Epic module X”), we may want to automatically notify the Epic team or link to Epic’s project request process. Possibly, the intake form could have a checkbox “This project involves changes to Epic.” If checked, the system could ensure additional steps (like integration review by the EHR team) are added. This kind of integration ensures that any Epic-related development goes through proper channels.\nData integration: For approved projects that relate to clinical operations, we might push information to Epic’s change management or interface with its development queue, though that might be beyond MVP.\nIntegration with ServiceNow (ITSM/PPM System): Ochsner likely uses ServiceNow (or a similar platform) for IT service management and possibly project portfolio management. Integration here is very valuable:\nProject Creation: When a project request is approved in the intake system, the system can automatically create a corresponding project record or portfolio item in ServiceNow (via REST API). This would carry over all relevant data (title, description, requester, justification, etc.) to avoid re-keying. Essentially, intake would feed the execution pipeline.\nStatus Updates: If ServiceNow is used to track project execution, the intake system might periodically get updates from it for display. For instance, once a project is in ServiceNow and being executed, the intake dashboard could show “Status: In Development (per ServiceNow)” or a link to the ServiceNow project record for more details.\nIncident/Idea Link: If some requests are actually coming via ServiceNow (for example, an employee might put in a ticket that is actually a project idea), we could capture those. However, since we are replacing the intake with our custom app, we might instead encourage all to use the new system and avoid ServiceNow for intake, to maintain the single channel.\nReal-time API calls: The integration will likely use ServiceNow’s available APIs. For MVP, we can implement a simple one-way push on approval. The specifics (like which fields map to ServiceNow fields) will be determined with the ServiceNow administration team.\nAnalytics and Data Warehouse: The data from the intake system (requests, decisions, timestamps, etc.) could be fed into Ochsner’s enterprise data warehouse or analytics tools for broader analysis. We could implement an API or nightly data export that sends intake data to the analytics team. This might enable combining intake data with other organizational data (for example, correlating number of project ideas with certain business outcomes).\nAlternatively, if Ochsner uses Power BI or another BI tool, we can directly connect the intake database to those tools for live reporting.\nEmail/Calendar Integration: Using Microsoft Graph API (for Exchange/Outlook), the system could integrate with calendars. For example, when a request is approved and needs a kickoff meeting, the system might help schedule it. Or, it could place tasks on approvers’ Outlook tasks list for requests they need to review. These are nice-to-have features to ensure the process integrates with how people work day-to-day (in Outlook, etc.).\nEnterprise Portal Integration: If Ochsner has an intranet or employee portal, the intake system should be linked there (so users can find it easily). Possibly, a widget on the intranet homepage could show “Have an idea? Submit to the Project Intake System” with a link.\nAPIs for Extensibility: We will design the intake system itself with an API-first approach. All core functionalities (submit request, update request, get status, etc.) will have API endpoints. This allows future integration or even use of the engine by other interfaces. For instance, perhaps someday someone wants to submit a request via a chatbot or another tool – they could use the API. Or if Ochsner adopts a new PPM tool, it could pull intake data via API. By having a robust REST API for the intake system, we ensure it can plug into the broader IT ecosystem easily.\nAuthentication and Security for Integrations: All integration points will use secure methods (OAuth2 for APIs where possible, secured tokens, etc.) aligned with Ochsner IT security policies. For example, the ServiceNow integration will use a service account with appropriate permissions to create records, and communication will be over HTTPS with certificate validation.\nTesting Integrations: We will set up test scenarios to ensure these integrations work properly (e.g., when an idea is approved, does it appear correctly in ServiceNow within a few minutes?). Also, if an integration fails (e.g., ServiceNow API is down), the system should log the error and notify an admin to retry or handle manually, ensuring no approved request is lost.\nBy integrating with Epic and ServiceNow, and other systems, the intake tool becomes part of a cohesive workflow from ideation to implementation. This not only saves effort (no re-entering data) but also accelerates time-to-value since approved ideas can quickly transition to active projects. It also helps with governance – keeping everything connected and traceable. In short, the new system will not operate in a silo, but rather complement and enhance Ochsner’s existing IT landscape.\nUser Roles and Workflow\nSeveral user roles will interact with the intake system, each with specific capabilities:\nRequester (Employee submitting idea): Any Ochsner employee or staff member who has an idea or vendor request. They can access the intake form (via SSO), submit new requests, save drafts, and view the status of their own submissions along with any feedback.\nIntake Administrator/Coordinator (PMO analyst): Members of the PMO or IT governance team who oversee the intake process. They have access to all submissions, can edit or add notes, perform initial triage, combine duplicates, and manage the categorization of requests. They can also configure certain system settings (like form fields, dropdown options, etc., if an admin UI is provided).\nReviewer/Approver (Leadership or Committee members): Individuals who are authorized to approve or reject requests. This might include IT leadership (like CIO, CDO), business unit leaders, a formal Intake Committee, or subject matter experts for certain domains. They will be assigned requests (or can pick up requests in their queue) to review after PMO triage. They can view all details and then input a decision with comments.\nExecutive Stakeholder (View-only): Some executives might not actively approve each request but still want visibility. They could have a view of the dashboard to monitor intake trends and statuses, without participating in every decision.\nIT Developer (for system maintenance): Not an end-user of the intake process, but responsible for maintaining the application. They would ensure integrations are functioning, update the software, and possibly manage user permissions. (This role is more about system operations.)\nWorkflow Steps: The end-to-end process for a project intake request will typically follow these steps (with roles involved at each stage):\nIdea Submission (Requester): An employee fills out and submits the project intake form in the system. They provide all required information about their idea. Upon submission, they receive a confirmation and can see their request listed in their dashboard as “Submitted” status.\nInitial Triage (Intake Coordinator): The PMO intake admin gets notified of the new request. They review the submission for completeness and assign a category or preliminary priority if needed. At this stage, the coordinator might do an initial internal scan – checking for duplicates or obvious existing solutions. If they find that the request is a duplicate or already answered by an existing system, they can reach out to the requester (via the system’s comment feature) or mark the request with a note. The coordinator then sets the request status to “Under Review” and assigns it to the appropriate Approver/committee queue.\nReview &amp; Evaluation (Approver/Committee): The designated reviewers are notified. They will log in and examine the request details. They will evaluate the proposal based on criteria like strategic fit, expected ROI, cost, urgency, etc. (Possibly aided by a scorecard in the system – an enhancement could be that reviewers can input scores for value, risk, etc., which the system averages or sums up to suggest a priority score. This is a potential feature to help prioritize based on business value and ROI). The reviewers can discuss via the comments if needed or hold a meeting (outside the system) but record the outcome in the system.\nDecision (Approver): The approver enters their decision in the system:\nIf Approved, they select “Approve” in the system. They might also choose an “approval type” (e.g., approved to proceed to scoping, or approved but put in backlog). They enter any comment and submit. The system updates the status to “Approved” (or a more specific status like “Approved – To Be Scheduled”).\nIf Rejected, they select “Reject” and must provide a reason (feedback). Status updates to “Rejected”.\nIf Deferred or Need More Info, they select a “Hold” or “More Info Required” option. In this case, they would detail what is needed (“e.g., please provide a detailed cost estimate” or “clarify how this differs from project X”). The system sets status accordingly.\nFeedback &amp; Resubmission (Requester/Coordinator): If more information was requested, the requester (or the intake coordinator on their behalf) can update the submission. The system allows editing certain fields or adding an addendum. Once updated, the request can be resubmitted into the review cycle. (The history will show that it was revised).\nTransition to Execution (Coordinator/Project Manager): For approved projects, the PMO or relevant execution team is alerted. Here, integration kicks in: the system might automatically create a project entry in ServiceNow or another PPM tool. The status in the intake system might change to “Approved – In Execution” once the project formally starts. The requester is informed that their idea was approved and is now being worked on (or scheduled). A project manager might be assigned at this point (possibly recorded in the intake system or in the external PPM and reflected back).\nClosure &amp; Post-Analysis: After a decision (approve or reject), the request is essentially closed in terms of intake. However, it remains in the system for records. If a project was executed, later the PMO can mark the intake request as “Delivered” or “Completed” and even attach outcome results (like “delivered in Q3 2026, achieved 95% of anticipated benefits”). This step is part of establishing a feedback loop to measure if the intake decisions yielded value, as few organizations currently do benefit analysis but it’s very important[12]. This data can help improve future decision-making.\nThroughout these steps, the system ensures that all stakeholders are kept in the loop – requesters can see when their idea moves stages, approvers have all info to decide, and leadership can see the overall flow. The process is standardized and documented, which contrasts with the previous ad-hoc or opaque method.\nFor example, consider a user story: Dr. Smith submits a request for a new telehealth scheduling tool. He fills out the form, linking it to the strategic goal of “Digital Health Expansion” and estimating it could increase patient visits by 10% (value) for a cost of $50k. He submits; the PMO coordinator Jane reviews it, notices there was a similar idea last year. She links that prior request in a comment. The request goes to the Digital Health committee; they see Dr. Smith’s justification and Jane’s note about the previous idea (which was put on hold due to budget). They discuss and decide to approve Dr. Smith’s proposal since the need is still valid and now higher priority. They click “Approve”, add comment “Approved – align with Digital Medicine program, high potential ROI”. Dr. Smith gets an email notification that his idea is approved, with the comment. A project is created in ServiceNow for the Telehealth Scheduling Tool, and a project manager is assigned. Dr. Smith can follow the progress via that project link. Three months later, that project is delivered. The intake request is marked Completed, and PMO notes that indeed patient visits increased as expected. This entire lifecycle is traceable in one system.\nTechnical Architecture and Platform\nThe Project Intake System will be developed as a cloud-hosted web application, aligning with Ochsner’s IT standards (which include heavy use of Microsoft Azure services). The architecture will emphasize scalability, security, and maintainability:\nApplication Stack: We propose using a modern web application framework. Given Ochsner’s ecosystem, a .NET 6+ (ASP.NET Core) web application is a strong option for the back-end, with a React or Angular front-end for a dynamic user experience. .NET is enterprise-proven and likely aligns with Ochsner’s existing skill sets and Azure integration. Alternatively, a full-stack JavaScript solution (Node.js + React) could be considered if that better fits the team’s expertise. The key is to use a framework that allows rapid development of forms, workflow, and integrates well with Azure services.\nHosting: The app will be hosted in Azure, possibly using Azure App Service for the web application and Azure SQL Database for the data store. Azure App Service provides easy scalability and managed hosting for web apps. We will have separate environments for development, testing, and production deployment to ensure reliability.\nDatabase: A relational database (SQL) will store the core data: requests and all their fields, user info (or references to AD IDs), status logs, comments, etc. A structured schema ensures we can query and report easily (e.g., using SQL for the reports). Azure SQL is a natural choice, or if using .NET, Entity Framework can handle ORM. We will design the schema to accommodate evolving fields (perhaps a flexible key-value store for additional custom fields, or just plan schema migrations as needed).\nAPIs: The server back-end will expose a set of RESTful APIs that the front-end uses. This includes endpoints for: authenticating (or rather, establishing session via SSO), submitting a request, fetching current user’s requests, admin fetching all requests, updating status, posting comments, etc. These APIs will also be used for integration (e.g., called by ServiceNow or by a bot if needed). JSON will be the data format. We will secure these APIs with proper authentication (JWT tokens from Azure AD, for example).\nAuthentication &amp; Authorization: We will integrate Azure Active Directory for SSO. Technically, this means using OAuth2/OIDC flows. The front-end will redirect to Ochsner’s login page, and upon login, a token is issued that the app trusts (we’ll register the app in Azure AD). We will use AD groups or roles to manage authorization (e.g., members of a certain AD group are Intake Approvers, others are just submitters). The app will enforce role-based access control in the UI and APIs – for instance, only users with the “Approver” role can call the approve/reject endpoint.\nUser Interface: The front-end will be built for responsiveness (so it works on desktop and mobile). Using a component library (like Fluent UI or Material UI) can ensure a consistent and accessible design. We will incorporate Ochsner branding (logo, colors) to give it a polished, official look. Client-side scripting will provide a smooth user experience (e.g., dynamic form sections, instant form validation feedback, search-as-you-type for duplicates, etc.). Where possible, we’ll use AJAX calls to make the experience seamless (no full page reloads needed).\nWorkflow Engine: We can implement the workflow logic in code (for MVP, simple if/else logic as per rules defined). If down the line the process becomes more complex, we might integrate a workflow/BPM engine or a state machine library. But initially, statuses and transitions are manageable within our application code. Status values (New, Under Review, Approved, etc.) will be enumerated and we’ll allow certain transitions when triggered by certain roles. This logic will be thoroughly tested to avoid invalid state changes.\nIntegration Implementation:\nServiceNow: Use ServiceNow’s REST API. This requires credentials (service account) and perhaps a minor development on the ServiceNow side to expose an endpoint for project creation if not already available. From our app, when a request is approved, we send an HTTPS POST to ServiceNow with a JSON payload of the project data. We’ll handle the response (ensuring it was created, capturing the new SN project ID, etc.). If the API call fails, we log it for retry.\nEpic: Direct integration is trickier. Epic does have APIs (FHIR endpoints) but those are mostly clinical data oriented, not really for “checking if Epic has a module X.” Instead, our approach is to maintain a reference list. We might connect to an internal service or database where the EHR team lists known Epic capabilities. If available, we could query that. Otherwise, Epic integration might be limited to including Epic stakeholders in the review loop rather than an automated API call. We might revisit this after initial rollout.\nEmail: We will use an email service to send notifications. Azure offers SendGrid or we can use O365 SMTP relay. Email templates will be created for each notification type. The system will trigger these on events.\nTeams/Chat: Possibly use Microsoft Graph API to post messages to Teams channels if desired. This can be configured later.\nReal-Time Updates: To give a real-time feel (e.g., if an admin approves a request while the requester’s dashboard is open, it updates), we might use WebSocket or SignalR to push updates to clients. This is not essential, but a nice touch. Otherwise, periodic auto-refresh or requiring user to refresh is simpler.\nScalability: With ~200 requests per month (as estimated), the load on the system is modest. Concurrent users might be in the tens, not thousands. So a single App Service instance and database will handle it easily. However, since it’s on Azure, we can scale out/in if needed. We should design statelessness in the app server (which is standard with ASP.NET Core) so that multiple instances can run behind a load balancer if needed. For storage scalability, Azure SQL at that volume is fine (and can scale DTUs as needed). We’ll also consider using Azure Cache (Redis) if there is any need to cache frequent reads (perhaps for the dashboard queries if heavy).\nSecurity and Compliance: Security is paramount, especially in a healthcare environment. While the intake data isn’t patient data, it could still be sensitive (it contains internal plans, possibly vendor info, etc.). We will ensure:\nAll traffic is over HTTPS with TLS 1.2+ encryption.\nData at rest in the database is encrypted (Azure SQL does this by default).\nProper authorization checks on every API (to ensure one user cannot fetch or modify another’s requests unless authorized).\nPenetration testing will be conducted on the app (common OWASP vulnerabilities like SQL injection, XSS, CSRF will be mitigated). We’ll use parameterized queries or an ORM to avoid SQL injection, output encoding to avoid XSS, and anti-forgery tokens for forms.\nLogging and monitoring will be set up (Azure Application Insights) to track usage and detect any unusual activities.\nThe system will comply with internal IT policies and any regulatory needs. Likely, since no PHI is involved, HIPAA compliance is not a direct concern, but we will still treat the data as internal confidential.\nBackups: Regular backups of the database will be configured (point-in-time restore capability) to prevent data loss. The infrastructure will be set up across at least two Azure regions or availability zones for disaster recovery (if one data center goes down, the app can failover).\nMaintainability: The codebase will be documented and source-controlled (e.g., in Azure DevOps or GitHub enterprise). We will set up a CI/CD pipeline for automated deployments to ensure new features or fixes can be rolled out quickly (important since we anticipate iterative improvements). Configuration (like integration endpoints, email settings, etc.) will be externalized (e.g., in Azure Key Vault or app settings) so that changes can be made without code edits.\nExtensibility: The architecture should allow adding new fields or features without major refactoring. For example, if next year Ochsner wants to add a field “Environmental Impact” to the intake form, we can add it to the form, database, and it will flow through. Using a modular design and perhaps form metadata can help. Also, if later on they want to incorporate AI (like an AI assistant to help fill the form or to evaluate proposals), we can integrate that thanks to the API-centric design.\nIn summary, the technical architecture leverages Azure’s reliable cloud platform, integrates with enterprise identity (SSO), and is built with scalable web tech. It’s a straightforward web app at its core – which is beneficial because it’s well within the team’s capability to deliver quickly. We are avoiding overly complex or bleeding-edge tech for this project, focusing instead on robustness and alignment with Ochsner’s environment. The design ensures that as Ochsner’s needs grow (more users, additional features, integrations), the system can grow with it.\nNon-Functional Requirements\nBeyond the core features, the system must meet several non-functional requirements (NFRs) to be successful:\nUsability &amp; Accessibility: The intake application must be very easy to use, even for non-technical staff. The UI should follow UX best practices and Ochsner’s style guides. It should also be accessible (WCAG 2.1 AA compliance) so that it can be used by staff with disabilities. Given that a major issue with the current system is poor usability, this is a top priority. We will conduct user testing with a few end-users to gather feedback on form design and clarity. If the intake process or tool is too complicated, people will perceive it as an obstacle and avoid it[1], so we will strive for simplicity without sacrificing necessary information.\nPerformance: The system should be responsive. Form interactions and page loads should happen in a few seconds at most. Given the scale (a few hundred requests per month), heavy load is not an issue, but the app should handle bursts of traffic gracefully (e.g., if after a town hall meeting, 50 users all log ideas the same day). The database and server will be sized to easily handle concurrent usage (targeting support for at least 100 concurrent users with no degradation, which is well above expected). Complex operations (like generating reports) should be optimized (maybe run in background or use database indexes effectively) to avoid slowdowns.\nScalability: While current usage is moderate, the design should allow scaling up (vertical) or out (horizontal) if needed. For instance, if in the future the intake system is also opened to affiliate hospitals or more use cases (like idea crowdsourcing from hundreds of clinics), we should be able to accommodate by adjusting infrastructure, not rewriting the app. Azure makes this straightforward, but our design (stateless web tiers, etc.) ensures it’s possible.\nReliability and Uptime: The system will be an important internal tool, though minor downtime is not life-or-death (unlike a clinical system). Still, we aim for high availability. Using Azure’s services, we will target at least 99.5% uptime (which translates to less than ~4 hours of downtime per month). This will be achieved via redundant instances and possibly multi-region deployment. We’ll schedule any maintenance or updates during off-hours and communicate those in advance.\nData Retention and Archiving: All intake submissions and their outcomes should be stored for future reference. We expect to retain this data for several years at minimum (to analyze trends over time). We will implement archiving rules if needed (for example, close out and archive requests older than 5 years to a separate storage, if database grows too large). But given the data volume (even 200 requests/month is 2400 a year; in 5 years 12k records – which is nothing a SQL DB can’t handle), we can keep data online for a long time. It’s more likely we archive based on relevance (like projects that were rejected 10 years ago may be purged or moved).\nConfidentiality and Privacy: The content in project requests might occasionally include sensitive information (e.g., mentioning vendor pricing, or referencing internal process issues). We will classify this data as internal confidential. Appropriate measures like access control (only authenticated users can see, and only authorized can see all data) are in place. We will also include a disclaimer or notice to users not to include any patient-identifiable information in submissions, since it’s not needed for project proposals and we want to avoid inadvertently handling PHI in this system.\nCompliance and Audit: The system should comply with any auditing requirements of Ochsner’s IT. This means an admin can produce logs of who accessed what, and any changes. The design already logs an audit trail of request actions. If needed, we can integrate with Ochsner’s SIEM (Security Information and Event Management) to forward logs for centralized monitoring (for example, any admin access or mass export of data could be flagged).\nMaintainability: The code will be modular and documented. The system will likely live for many years, so it should be easy for future developers to maintain. We’ll provide an admin manual (for PMO) and technical documentation (for IT). Configuration changes (like updating strategic goal options, or tweaking email templates) should be possible without code changes – either through an admin UI or config files – to reduce the need for developer intervention in simple updates.\nExtensibility: The scope of this system could expand (maybe to intake other kinds of requests like capital expenditures or research proposals). We should design it in a way where adding new categories or slightly different forms is possible. Perhaps our data model can accommodate custom fields or we allow multiple intake “forms” if needed. While not a requirement now, designing with a bit of foresight could save time later.\nResponse to Feedback: After deployment, users might suggest improvements (e.g., “It would be nice if the form had a field for X” or “Can we integrate with SharePoint to attach files from there?”). We consider the initial launch as an MVP that we will iterate on. Non-functional in this sense is agility: we will set up a process to gather user feedback and roll out enhancements continuously. This will ensure the tool remains aligned with user needs and organizational priorities (since priorities can change, the tool must evolve too[7]).\nCost Efficiency: Since we’re decommissioning an expensive tool, we must ensure our solution is cost-effective. Using Azure services, we will monitor the monthly operational cost (App Service, DB, etc.). We aim to keep it minimal – likely just a few hundred dollars a month at most for the infrastructure, which is trivial compared to the presumably high licensing cost of ProcessUnity (which might be on the order of thousands per month). This will deliver immediate cost savings. If the system usage grows, costs might increase, but by then it would be justified by value, and still likely far less than enterprise SaaS licensing for intake.\nTesting: Prior to launch, the system will undergo thorough testing: unit testing of components, integration testing (especially for the workflow and external integrations), and user acceptance testing with a pilot group of end-users. We will also test edge cases (e.g., very large text inputs, or what if an approver goes on vacation – can someone else take over their requests, etc.). A staging environment will mirror production for this testing.\nDeployment and Rollback: We will have a robust deployment strategy (perhaps blue-green or canary releases in Azure) so we can deploy updates with minimal downtime and ability to rollback if an issue is discovered. This ensures even after go-live, the system can be updated reliably.\nBy meeting these non-functional requirements, we ensure that the Project Intake System not only has the needed features but also delivers them in a reliable, secure, and user-pleasing manner. The system’s success will be measured not just by functionality, but by adoption (users actually using it vs. circumventing it) and by improved outcomes (e.g., shorter intake cycle times, better project success rates). Those outcomes are only possible if the system is performant, easy, and trustworthy.\nImplementation Plan and Timeline\nDeveloping and rolling out this new intake system will be approached in phases:\nPhase 1: Analysis and Design (Current) – We have gathered requirements (business and technical) and are formalizing the specification (this document). This phase also involves securing stakeholder buy-in (which we have from Adam and likely from IT leadership given the pain points). At the end of this phase, we have a clear scope and design for the system.\nPhase 2: MVP Development (Months 1-2) – Build the core features: the submission form, basic workflow (single-stage approval), personal dashboard, and admin list. Integrate SSO for login. We will also implement at least one key integration (likely the ServiceNow project creation) in this phase, as it’s straightforward and demonstrates value. The intelligent scan feature can be stubbed or kept simple (maybe just a manual checklist for the coordinator). We will use synthetic or sample data to test the system internally. By the end of Month 2, we aim to have a working prototype that can be demoed to stakeholders (targeting a demo by January as requested).\nPhase 3: Testing and Pilot (Month 3) – Conduct thorough testing with a small group of users (e.g., a few employees and a few approvers from one department). Gather feedback on the form usability and workflow. Make iterative improvements – for example, if testers find a field confusing, adjust the label or help text. Also test integrations in a staging environment (maybe with ServiceNow sandbox, etc.). Address any security testing findings. During this phase, we also prepare training materials or quick reference guides for broader rollout.\nPhase 4: Go-Live (Month 4) – Launch the system across Ochsner (all 48 hospitals and units). This involves communications to all staff about the new process (possibly coordinated with leadership announcements like “We have a new intake portal, effective now all project/vendor ideas should go through it”). We’ll deprecate ProcessUnity by transferring any in-flight requests from it into the new system (this might be done manually if volume is low, or via data import if feasible). The go-live will likely be gradual – perhaps first open it to corporate departments, then to clinical departments, etc., to ensure support is available.\nPhase 5: Post-Live Enhancements (Month 5 onward) – After initial rollout, we will focus on the intelligent features and additional improvements:\nEnhance the internal/market scan intelligence (possibly integrate a simple AI service or expand the knowledge base).\nAdd more advanced reporting and possibly a scoring/prioritization module (if leadership wants to rank projects by value).\nIntegrate with any other systems identified (for example, if Ochsner has a strategic portfolio dashboard, feed our data there).\nIncorporate a feedback loop for completed projects (tie back actual performance).\nGeneral refinements: UI tweaks, performance optimizations, etc.\nWe will use Agile methodology to deliver this project, likely in 2-week sprints. This means stakeholders (like Adam and representatives of requesters and approvers) can see incremental progress and provide input continuously. The tight timeline to have a demo by January is feasible because we are focusing on core features first and using known technology. In fact, much of the functionality (form, CRUD operations, simple workflow) is standard web development fare – we’re not inventing new algorithms but rather implementing best practices with customization.\nRisk Mitigation: Potential risks and how we address them: - User Resistance: Some employees might be used to emailing ideas or using the old tool. We mitigate by making the new tool clearly superior (ease of use) and by getting leadership endorsement to mandate its use. Training sessions or short videos can help introduce it. - Scope Creep: The wish list for an intake system can be endless. We will keep the initial scope focused. Extra features (like full AI analysis or deep resource planning integration) will be noted for future phases. Stakeholders are aligned that basic functionality and usability come first. - Integration Challenges: The ServiceNow integration requires coordination with another team. We’ll engage them early (if not already) to ensure API access. If that integration is delayed, it doesn’t break our core system – we can always output a report for PMO to manually create projects as a stopgap. Similarly, Epic integration is not critical path; it’s a bonus feature for later. - Data Migration: If we need to pull existing records from ProcessUnity, we’ll do so carefully. This might involve exporting to Excel and then importing into our DB. Ensuring no loss of historical data might be important to PMO. We plan for a one-time import if needed. - Security Concerns: Being a new internal app, IT security will review it. We will work closely with them to pass any audits (fortunately using SSO and Azure means much is standard). We allow ample time for security testing in Phase 3. - Timeline Crunch: If unforeseen issues arise and MVP isn’t ready by January for demo, we will have a backup demo using a partial prototype or even a slideware simulation (but given our confidence, we aim for a real prototype). The idea is to show leadership a clickable, working system to build confidence. We can prioritize demo-critical features (submission, tracking, a dummy dashboard) first.\nExpected Benefits and Value Proposition\nImplementing the custom Project Intake System will yield significant benefits for Ochsner Health:\nCost Savings: First and foremost, replacing ProcessUnity will eliminate its licensing and maintenance costs. If that tool costs, for instance, \\$X per year in licenses (plus any admin overhead), the new system will largely eliminate that expense after only the initial development effort. Ochsner can reallocate those funds to more mission-critical initiatives. Over a few years, this could amount to hundreds of thousands of dollars saved, directly improving the IT budget’s bottom line.\nHigher Engagement and More Ideas: With a user-friendly submission process, employees will be far more likely to actually use the system to propose innovations. We anticipate an increase in the number of project ideas submitted, especially from front-line staff who might have avoided the old system. This taps into the creativity of the workforce – more ideas mean a greater chance of discovering high-value opportunities. It fosters a culture of innovation, as people see that suggesting improvements is easy and welcomed (and that their ideas won’t disappear into a void).\nBetter Project Proposals (Quality): The structured form and guidance will lead to more complete and thought-out proposals. By requiring strategic alignment and value estimation, requesters must do some homework and critical thinking. This means leadership will be evaluating proposals that have clearer justification and context. The days of one-liner requests with no rationale will be gone. As a result, the approval decisions will be based on solid information, which in turn will yield higher success rates for projects (because the ones approved have clear value and alignment). Industry best practices affirm that an intake process that aligns projects with strategy and focuses on value leads to choosing higher-impact projects and filtering out low-value ones[13][7].\nStrategic Alignment and Portfolio Value: Because each request is linked to strategic objectives and measured by value, the portfolio of approved projects will inherently be more aligned to Ochsner’s strategic goals. Leadership can confidently say “we are investing in the right things.” The intake system becomes a tool for strategy execution – ensuring every new project is contributing to the organization’s objectives or it doesn’t get done. This alignment prevents wasted effort on projects that don’t move the needle on Ochsner’s key goals. As one reference puts it, optimized intake reduces portfolio waste on low-value projects and gives primacy to the highest value requests[14][15].\nImproved Transparency and Accountability: The single, centralized pipeline of requests provides visibility at all levels. Leadership gains oversight of all incoming demand in one place (no more surprises or shadow projects). Departments can see where their requests stand and that everything is being handled via a fair process. This transparency builds trust: employees trust that if they submit an idea, it will actually be reviewed and not vanish; executives trust that projects under consideration are going through due process. It also holds everyone accountable – e.g., if an approver is sitting on many requests without action, that’s visible and can be addressed. In modern portfolio management, having one transparent intake channel eliminates confusion and off-the-grid initiatives[10], which is exactly what Ochsner will achieve.\nFaster Time to Value: A more efficient intake process means good ideas get to execution faster. By reducing bottlenecks (like not knowing who should approve or losing track of requests), we shorten the cycle from idea to project start. This agility is crucial in healthcare where improvements (like a new digital tool or process change) can directly benefit patient care or operations sooner. Additionally, by integrating with project execution tools, we cut out administrative lag (no retyping info into another system). The references highlight that optimizing intake can decrease time to value and improve efficiency[3] – Ochsner can expect to realize the benefits of approved projects sooner.\nData-Driven Decision Making: With the analytics and reports, Ochsner’s leadership will have data on the innovation pipeline. They can spot trends (e.g., many requests coming to improve digital front door experience – maybe invest more there) or identify gaps (e.g., no requests in a strategic area – maybe communicate focus or encourage ideas there). They can also monitor the ROI projections of upcoming projects and post-project outcomes to continuously refine their investment strategy. This moves decision making from anecdotal or whoever’s loudest, to objective criteria. In essence, the intake tool becomes a decision support system, not just a data collection form.\nEnhanced Cross-Department Collaboration: With a centralized system, different departments can see each other’s ideas (at least those that are not confidential). This can spark collaboration – e.g., the cardiology department sees that primary care proposed a telemedicine follow-up project; they might reach out to join forces if they had a similar need. By breaking down silos of proposal information, the organization can unify efforts and avoid duplicate work. Everyone working off the same list helps ensure resources aren’t unknowingly competing or duplicating. This supports enterprise-wide optimization rather than local sub-optimal projects.\nGovernance and Compliance: The new system inherently enforces a governance structure. This reduces the risk of projects being executed without proper approval or projects bypassing IT oversight (which could lead to rogue IT spend or compliance issues). Every initiative will have a documented approval trail. If an audit or inquiry happens (“Why was Project X initiated? Who approved this vendor?”), the answers are readily available. Also, by involving necessary groups like IT Security or Legal during the intake (e.g., maybe certain questions trigger a security review), the organization stays compliant with internal policies (for instance, ensuring all vendor software is vetted). It’s easier to manage risk when the process is formalized.\nEmployee Satisfaction and Morale: For employees, being able to submit their ideas and see them progress is empowering. It gives them a voice in organizational improvement. Even if an idea is not approved, the fact that they got feedback (“this doesn’t align right now because…”) is a learning opportunity and shows respect for their input. This can improve morale and engagement, as employees feel heard and part of the innovation process. It fosters a continuous improvement culture.\nShowcasing IT Innovation: Internally, delivering this system demonstrates that the IT/digital team can respond quickly to internal needs with custom solutions. It’s a relatively fast win that will build credibility. For the CIO and CDO, this project is a tangible example of improving IT operations and governance. It shows a commitment to best practices and could even be something they highlight in performance reviews or board meetings (modernizing internal processes to be best-in-class). It transforms a pain point into a showcase of efficiency.\nScalability to Other Uses: Once this platform is in place, Ochsner can potentially extend it to other intake processes – e.g., capital expenditure requests, marketing campaign requests, or even external partner project requests. The flexible foundation means additional forms or workflows could be added, leveraging the same framework. This consolidates tools (no need to buy another product for each type of request) and further saves costs. Essentially, we’re building an “intake engine” that could handle multiple use cases in the future.\nMeasurable Outcomes: We will be able to measure the impact of this new system. Some KPIs to track:\nIncrease in number of ideas submitted (quarterly) – indicating higher engagement.\nDecrease in average time from submission to decision – indicating efficiency.\nPercentage of projects approved that meet or exceed their predicted benefits – indicating better initial scoping (though this is longer-term to measure).\nUser satisfaction survey results for the intake process – expecting a jump once new tool is in use versus baseline dissatisfaction currently.\nWe expect positive movement in all these areas, confirming the value.\nFrom leadership’s perspective, the ROI of this project is very high. The investment is the development effort (which, for an internal team, is mainly opportunity cost and a bit of infrastructure cost). The returns include direct cost savings (tool elimination) and more importantly, improved portfolio outcomes that can save or generate millions. For example, avoiding a single ill-conceived project (that might have wasted \\$500k) or capturing a great idea (that generates \\$1M in revenue) far outweighs the cost of building this system. By instituting discipline in intake, Ochsner will approve only the right projects – those aligned with strategy and capacity – and say no to projects that don’t meet the bar[15], ultimately ensuring that resources are invested in initiatives with the highest impact on patient care and organizational success.\nIn summary, the new Project Intake System will transform a weak link in Ochsner’s innovation pipeline into a strength. It delivers financial savings, better decision-making, and a more innovative culture. It directly addresses the pain points of both users and leadership. By having this custom, intelligent intake process, Ochsner can accelerate innovation and stay ahead in the rapidly evolving healthcare landscape, making sure every project it undertakes truly advances its mission and strategic goals. The value proposition is not just about fixing a tool – it’s about enabling Ochsner to make smarter investments and ultimately provide better healthcare services through the right projects.\n[1] [2] [3] [4] [7] [8] [9] [11] [12] [13] 7 Ways to Improve Your Project Intake Process\nhttps://regoconsulting.com/7-ways-to-improve-your-project-intake-process/\n[5] [6] What is a Project Intake Process &amp; Steps to Improve it\nhttps://www.saviom.com/blog/intake-process/\n[10] [14] [15] Optimize IT Project Intake, Approval, and Prioritization | Info-Tech Research Group\nhttps://www.infotech.com/research/ss/optimize-it-project-intake-approval-and-prioritization",
    "config": {
      "name": "Project Intake",
      "description": "---\n\n# Context Document: 4. Project Intake System Replacement – Detailed Specification.docx\n\nProject",
      "techStack": [
        "next.js",
        "typescript",
        "tailwind"
      ],
      "requirements": "---\n\n# Context Document: 4. Project Intake System Replacement – Detailed Specification.docx\n\nProject Intake System Replacement – Detailed Specification\nBackground and Problem Statement\nOchsner Health’s current project and vendor request intake process relies on a third-party tool (ProcessUnity) that has proven to be a poor fit. Employees who want to propose new project ideas or vendor requests find the existing tool unintuitive and cumbersome. This results in frustration, incomplete submissions, and potentially fewer ideas being formally proposed. In effect, the “front door” for new initiatives is not welcoming – it’s hard to navigate and requires significant effort to submit requests. As a consequence, important project ideas may fall through the cracks, and the leadership lacks confidence that they are seeing all viable proposals.\nThe current system also incurs high licensing and maintenance costs for functionality that should be straightforward. This drains budget that could be better used elsewhere. Moreover, once a request is submitted, there is a lack of transparency in the approval process. Requesters often cannot easily determine the status of their submission or who is reviewing it without digging into the unfriendly tool interface. In plain terms, the intake process is chaotic and opaque. This can slow down innovation (if proposing a project is too difficult, people will simply stop trying) and can lead to suboptimal decisions – projects might be approved without a strong business case, while high-value ideas might be overlooked due to poor initial justification.\nOverall, the pain is felt across the board: employees dislike the hassle of using the current system, and leadership isn’t getting the quality information or oversight needed. With too little upfront information or guidance, projects can be approved that don’t align with strategy or fail to deliver real value[1]. An ineffective intake process ultimately means wasted resources on low-impact projects and missed opportunities for high-impact ones.\nGoals and Objectives\nThe primary goal of this initiative is to replace the existing intake tool with a custom-built Project Intake System tailored to Ochsner’s needs, thereby addressing the pain points above. The new system will provide a streamlined, user-friendly experience for submitting and tracking project requests, while ensuring that leadership receives high-quality, consistent proposals for evaluation. Key objectives include:\nEnhance Usability and Adoption: Create an intuitive web-based intake portal that makes it painless for employees to submit new project or vendor requests[2]. A simpler process will encourage more innovation by removing friction.\nEnsure Strategic Alignment and Value: Guide users to provide necessary business case information (strategic alignment, expected benefits, cost estimates, etc.) so that each proposal clearly articulates its value. This will help prioritize the right work and reduce waste by focusing on ideas that support organizational goals[3].\nImprove Transparency: Implement a single, transparent list (dashboard) of all requests and their status, giving stakeholders a one-stop view of the project pipeline[4]. This “single pane of glass” ensures nothing falls through the cracks and that everyone can see where each idea stands.\nStreamline Workflow and Approvals: Define a clear intake and approval workflow with designated reviewers and decision points. The system will route requests to the appropriate leaders (e.g. PMO or governance committee) and track decisions (approve/hold/reject) with feedback. Open communication of decisions is key so that everyone is aware of outcomes and next steps[5].\nReduce Costs: Eliminate the licensing fees of the third-party tool by leveraging in-house technology (built on Azure). The custom solution avoids recurring vendor costs (estimated to save significant budget annually) while providing ownership to adapt the system as needs evolve.\nIntegrate for Efficiency: Ensure the new intake system can integrate with Ochsner’s existing IT ecosystem – from single sign-on for user authentication to potential linkage with systems like Epic and ServiceNow. This will enable seamless transitions (for example, approved ideas can be pushed into the execution system without manual re-entry) and leverage data from other sources to avoid duplicating solutions.\nBy achieving these objectives, Ochsner will have a modern intake process that encourages innovation, captures robust justifications for new initiatives, and provides leadership with visibility and control over the project portfolio.\nSolution Overview\nProposed Solution: Develop a custom Project &amp; Vendor Request Intake web application for Ochsner Health, hosted on Azure. This system will replace ProcessUnity and be fully tailored to Ochsner’s process and terminology. It will serve as a centralized portal where employees (across 48 hospitals and other units) can submit new project proposals or vendor requests, and where those requests are reviewed, tracked, and managed through to approval.\nThe solution will consist of a modern front-end user interface for form submission and dashboards, and a secure back-end with a database to store request data and workflow status. The application will integrate with Ochsner’s Single Sign-On (SSO) for authentication, so that any employee with proper credentials can access the intake form and so that submissions are tied to the user’s identity automatically.\nOnce a request is submitted, the system will support an end-to-end workflow: initial triage, review by the relevant committee or approvers, and final disposition. Throughout this process, requesters and stakeholders can view the status of the request on a dashboard. The system will send notifications (e.g. emails or in-app alerts) at key stages to keep everyone informed.\nCrucially, the intake form will be designed not just to collect data, but to improve the quality of proposals. It will include guided sections to ensure the requester provides all needed information for evaluation – such as the project’s alignment to strategic objectives, expected ROI or benefits, costs, and any known alternatives. The system may also incorporate an “intelligent scan” feature to help identify if similar solutions exist internally or in the market (preventing redundancy). For example, if a user proposes a “new appointment reminder system,” the tool could prompt that an Epic module or an existing vendor solution might cover this need.\nThe new intake system will also feature built-in reporting and analytics capabilities. Leadership and PMO will be able to generate reports on demand (or view real-time charts) showing metrics like the number of requests submitted over time, approvals vs rejections, average evaluation times, and categorization of requests by strategic goal or department. This data will support continuous improvement of the intake process and portfolio planning.\nIn summary, the solution is a user-friendly, intelligent intake portal that will strengthen how Ochsner captures and vets new initiatives. It ensures each idea is documented with a strong business case, checks that the idea is novel or justified, and provides full visibility into the intake pipeline from submission to approval.\nKey Features and Functional Requirements\nBelow are the major features and functional requirements of the proposed intake system:\n1. Modern User-Friendly Submission Form\nIntuitive Web Interface: A clean, easy-to-navigate web form for submitting project or vendor requests. The interface should be accessible via standard browsers and mobile-friendly if possible. It must be simple enough that employees with no special training can use it on first try.\nSingle Sign-On (SSO) Integration: Users will authenticate via Ochsner’s Azure Active Directory (or relevant SSO) to access the form. This ensures that submissions are tied to the user’s identity (auto-capturing the requester’s name, department, etc.) and that only authorized internal users can submit requests.\nGuided Input Fields: The form will capture all required information for a new initiative in a structured way. Fields will include:\nProject Title – A short name for the proposed project or request.\nDescription of the Idea/Request – A detailed description of what is being proposed and the problem it aims to solve.\nBusiness Objective / Strategic Alignment – The requester must select or specify which strategic goal or organizational priority this initiative supports (e.g. “Improve patient experience”, “Increase operational efficiency”, etc.). Ensuring proposals are linked to business objectives is a best practice for intake.\nExpected Benefits/Value – A description of the expected benefits, outcomes, or ROI. This might include qualitative benefits (e.g. improved patient satisfaction) and quantitative estimates (e.g. projected cost savings or revenue increase). The form may prompt for specific metrics (e.g. “Estimated annual cost savings in USD”). Requiring an articulation of value and ROI helps leadership make informed decisions.\nEstimated Costs – An initial rough estimate of the cost or resources required (if known). This could be a dollar range or effort estimate, to gauge scale.\nUrgency/Priority – The requester can indicate if the need is time-sensitive or tied to a regulatory deadline, etc.\nDepartment/Stakeholders – Which department or business unit is requesting this (auto-filled if possible from user’s profile) and any other stakeholders or sponsors involved.\nAttachments – Ability to upload supporting documents (e.g. a slide deck or business case document, if the requester has one).\nExisting Solutions Considered – A field to note if the requester is aware of any existing internal system or vendor product that was considered. (This nudges the user to do some due diligence before submitting.)\nDynamic Help and Templates: The form will include help text or tooltips for key fields to guide users on how to answer effectively. For example, next to “Expected Benefits,” a tooltip might say: “Describe how this will create value (e.g. improve patient outcomes, save cost, generate revenue). Be as specific as possible, e.g. ‘Reduce manual work by 20% leading to $X savings per year.’” This guidance is aimed at strengthening the business case content at submission time. The system might also provide examples or a template for answers (e.g. a template business case structure).\nProgressive Disclosure: To avoid overwhelming users with one huge form, the intake form might be broken into sections or steps (e.g. Step 1: Basic Info, Step 2: Impact and Alignment, Step 3: Cost and Alternatives). This keeps the interface clean and encourages completion.\nSave Draft Capability: Users should be able to save a draft of their request and come back to finish it later. Given that gathering all required info (like cost estimates or stakeholder approvals) might take time, this feature will improve completion rates.\nValidation and Required Fields: The system will enforce that all mandatory fields (like Title, Description, Strategic Alignment, Expected Benefits, etc.) are filled before allowing submission. If a user tries to submit without key info, it will highlight what’s missing. This ensures completeness and consistency – having a consistent format for proposals allows fair evaluation and comparison[6].\nUser-Friendly Experience: Throughout the form, the emphasis is on ease of use – minimal clicks, clear labels, and no extraneous complexity. The goal is that submitting a proposal should take only a few minutes for a well-prepared user. The design will follow web accessibility standards and Ochsner’s UX guidelines. By making it simple and even “painless for the requester to input data”[2], we expect higher adoption and more high-quality submissions.\n2. Strengthened Business Case Input and Guidance\nStrategic Alignment Enforcement: As noted, the form requires linking each request to Ochsner’s strategic objectives. This might be implemented as a dropdown menu of current strategic pillars (e.g. “Digital Medicine Expansion”, “Patient Experience Excellence”, “Operational Efficiency”, etc.) with an optional text for details. This ensures requesters consciously think about alignment. Leadership can later filter or sort requests by these alignments.\nValue and ROI Prompts: The system will encourage users to quantify benefits. For instance, if a user selects a benefit category (“cost savings”), an additional field could prompt “Approximate annual savings (in $ or FTE hours)”. If they select “revenue growth”, prompt for how much revenue or how it drives growth. These inputs help build a rough ROI (e.g. compare estimated benefits vs. costs) which can be displayed to approvers. While precise numbers may not always be available, even rough estimates focus the requester on the project’s business value.\nAuto-Calculations: The form can perform simple calculations or checks – for example, if the user provides an estimated cost and benefit, calculate an ROI percentage or payback period and show it. This immediate feedback might encourage the requester to refine their numbers if the ROI looks weak. (This is an optional feature for MVP, but conceptually aligns with making the business case stronger.)\nBest Practice Tips: Inline with certain fields, the system may show tips drawn from PMO best practices. For example, when filling “Project Description”, a tip could appear: “A good project proposal clearly defines the problem and how your idea solves it. Mention who it impacts and the expected change.” For “Strategic Alignment,” a tip might remind: “Projects aligned to strategic goals are more likely to be approved[7]. Select the goal that this initiative supports and briefly explain the connection.” These tips can be informed by internal guidelines or general intake best practices.\nRequired Justification for Large Requests: If a request is above certain thresholds (for example, expected cost &gt; $500k or cross-department impact), the form could dynamically reveal extra required fields, such as a more detailed risk assessment or requiring VP sponsor name. This ensures big initiatives have commensurate detail.\nConsistency and Completeness Checks: By structuring the input, we ensure each proposal has the key components of a business case. This uniformity allows the PMO and leadership to evaluate proposals side-by-side using predefined criteria[6]. The system, in effect, enforces a template that every requester follows, reducing the chances of approving poorly defined projects or missing critical information.\nThis focus on thorough and aligned business cases means leadership will receive higher-quality proposals. Over time, that leads to better project selection and outcomes – many organizations find that when intake is done thoroughly and tied to strategy, project success rates improve as low-value initiatives are filtered out early[1][7].\n3. Intelligent Internal/Market Scan for Redundancy\nDuplicate Detection: To avoid redundant projects (different people unknowingly requesting similar solutions), the system will include a mechanism to flag potential duplicates or overlaps. When a user enters the project title or description, the system can automatically search existing requests in the database for similar keywords. If a similar proposal was submitted recently, the user might see an alert: “Possible similar request: ‘Upgrade Appointment Reminder System’ submitted on 10/12/2025.” This allows the requester to reconsider or at least acknowledge the similarity in their submission. It also encourages collaboration (they might reach out to that requester or combine efforts).\nKnowledge Base Integration: We will maintain an internal knowledge base of known solutions and past projects. For example, a small library of entries like “Epic capability modules” or “Existing enterprise systems” and common vendor products in healthcare IT. The intake system’s intelligent scan can use the description text to match against this knowledge base. E.g., if someone writes “need a tool to send automated patient appointment reminders,” the system could return: “Recommendation: Ochsner’s existing system (Epic MyChart) has a module for appointment reminders – consider leveraging that before building new.” This feature might be implemented as a simple keyword match initially. In future, an AI/NLP component could analyze the request description and search documents or the web for similar solutions. The goal is to prevent approving projects that could be satisfied by existing capabilities, saving time and money.\nVetting Questions: In addition to automated scans, the form itself may ask the requester: “Have you checked if an existing internal system or vendor could solve this need? If yes, please describe why the existing solution doesn’t meet your needs.” Forcing an answer to this can prompt the requester to do a quick internal inquiry or research before submitting. As cited in best practices, having a gatekeeper or initial vetting can weed out duplicate or misaligned ideas early[8].\nIntake Coordinator Review: As part of the workflow (described later), an intake coordinator or admin role will manually review new submissions for obvious duplicates or existing solutions. They will have tools to merge duplicate requests or mark a submission as needing more research on available solutions. The system should allow linking related requests together (for example, flagging that Request #123 is similar to Request #110 and perhaps should be considered together or merged).\nOutcome of Scan: The results of any internal scan or coordinator notes will be visible to the approvers. For instance, a section in the request details might say: “Similar Solution Found: Epic’s Appointment Reminder (details…)” or “Duplicate Request: matches request ID 110 submitted by Dept X.” This information arms decision-makers with context to avoid green-lighting a redundant project or to direct the requester to an existing solution (possibly resulting in a quick win rather than a new project).\n(For the Minimum Viable Product, the intelligent scan can be rudimentary – e.g., a simple search and a manually maintained list of common tools. The concept, however, demonstrates an “intelligent intake” that leverages knowledge to avoid reinventing the wheel.)\n4. Workflow Management and Approval Process\nSubmission and Acknowledgment: Once a user submits the intake form, the system stores the request in a database and assigns it a unique Request ID. The requester should receive an immediate confirmation (on-screen and via email) that their idea was received, along with the Request ID and a summary of the submission.\nRouting to Reviewers: The system will determine the appropriate review path based on the type of request. For example:\nIT project requests might be routed to the IT Governance Committee or PMO for initial review.\nVendor/technology requests might notify the Supply Chain or IT vendor management team.\nDepartment-specific improvements might route to a departmental leadership queue.\n(These rules can be configured, but for MVP, a simple approach is: all requests go to a central PMO/Intake team first. They will then assign reviewers or committees as needed.) - Review &amp; Triage Stage: An intake coordinator or PMO analyst will first check the submission. They verify the form is complete and may add supplemental info (e.g., note potential duplicates or assign a category like “Clinical System” vs “Operational”). At this stage, they might also engage the requester for any clarifications (the system should allow adding comments back to the request). - Governance/Approval Stage: After initial triage, the request moves to a decision stage. The relevant decision-makers (could be a standing Intake Committee that meets regularly, or specific executives for certain categories) are notified that a new request is “Under Review”. They can log into the system to see the full request details and any PMO notes. - Decision Capture: The approvers have options to Approve, Reject, or Defer/Hold the request: - Approved for Further Action: This means the project is justified and should move forward into scoping or execution. The system will mark it as “Approved” and can trigger the next steps (such as creating a project entry in a project management tool – see integrations – or notifying relevant execution teams). - Rejected: This means the idea will not move forward (at least in its current form). The approver must provide a reason or feedback (e.g., “Duplicate of ongoing project X,” or “Business case not strong – ROI too low”). This feedback is recorded in the system. - Deferred/Hold: Neither an outright yes or no – perhaps the committee needs more information or wants to reconsider later. The request might be marked as “Pending” or “Need Info” and sent back to the requester or PMO for clarification. The system should allow looping back: e.g., the approver can request changes or more data, and the requester can update the submission or provide answers, then resubmit for review. - Multi-Level Approvals (if needed): For large projects, there might be multiple approval stages (e.g., initial approval by department head, then final approval by enterprise PMO or executive). The system should be flexible to support a multi-stage workflow. For now, a single approval stage is default, but the design will not preclude adding another (perhaps using a status like “Approved by Dept – Pending Executive Approval”). - Tracking and Audit Trail: Every action in the workflow is logged. This includes submission time, review assignments, status changes, and comments/feedback. This audit trail ensures accountability and makes it clear who decided what and when. It also helps if any request is questioned later; leadership can see the rationale recorded. - Notifications: The system will automatically send notifications at key points: - After submission (to requester confirmation, and to intake admins for a new request). - When a status changes (e.g., “Your project request has been approved” or “has been rejected/closed”). The notification will include any comments from approvers. - When more info is requested, the requester gets a notification to update their submission. - When an approved project is transitioned to execution, possibly notify the assigned project manager/team.\nThese notifications can be emails and/or in-system notifications (e.g., a notification bell icon in the app). Ensuring timely, transparent communication of decisions is critical so that contributors aren’t left in the dark[5]. - Dashboard for Approvers: Those in reviewer/approver roles will have a specialized view where they can see all pending requests awaiting their decision. This might be a list or queue with basic info (title, requester, submission date, and perhaps a priority score). Approvers can click into each to read details and then record their decision. This streamlines the review meetings or processes, as all needed information is at their fingertips in one system. - Configurable Workflow: Administrators of the system (likely the IT team building it, or PMO leads) should be able to adjust certain workflow settings. For example, adding a new status or changing who gets notified for certain categories. We may implement a simple rules engine or at least make some aspects configurable via an admin UI. This flexibility is important because Ochsner’s governance processes might change over time, and the tool should adapt without requiring a complete overhaul.\n5. Status Tracking and Transparency Dashboard\nRequester Dashboard: Each employee who submits an idea can later log into the intake system and see a personal dashboard of their submissions. For each request, it will display the current status (e.g. “Under Review by PMO”, “Approved – pending scheduling”, “Rejected – see feedback”), along with key dates (submission date, last update) and any reviewer comments. This addresses the current pain point of not knowing what happened after submission – now it’s clearly visible. The interface will make it easy for a requester to track their idea’s journey, fostering transparency and trust in the process.\nOverall Intake Pipeline View: A central dashboard will list all project/vendor requests in the system (or at least all active ones) with filters for status, department, strategic alignment, etc. This is the “single source of truth” for incoming work. Having one transparent list of all ideas being considered promotes stakeholder understanding and ensures nothing is off-the-record[9]. For example, leadership can see in one view all proposals submitted this quarter, and their statuses, instead of searching emails or disparate tools.\nVisualization of Stages: The dashboard can also present a visual indicator (like a progress bar or step markers) for each request, showing how far along it is in the process. E.g., a request might show “Stage: 3/5 – Under Executive Review” which corresponds to the defined workflow stages. This gives at-a-glance insight into pipeline health (e.g., many stuck in review, or many recently approved).\nAnalytics on Dashboard: We can incorporate summary statistics on the main dashboard. For instance, counters for “New Requests (past month)”, “Requests Under Review”, “Approved this year vs Rejected”, etc. A chart could show submissions trend over time. These provide a quick health check of the intake funnel and can highlight if there’s a bottleneck (e.g., if the number under review is very high, perhaps reviews are slow).\nDrill-down and Search: Users (with appropriate permissions) can search the list by keyword or filter by categories. This helps anyone (especially PMO or leadership) find if a certain idea has been proposed before. For instance, before submitting a new idea, an employee could search the repository to see if a similar idea exists – another way to reduce duplicates.\nSecurity/Visibility Controls: While transparency is important, we may restrict certain data to certain roles. For example, a normal employee might only see their own requests, while a department head might see all requests in their department, and PMO/leadership can see all requests organization-wide. The system will implement role-based view permissions to accommodate this. However, the default ethos is to make the intake list as open as possible within the organization to encourage collaboration and awareness.\nExport &amp; Reports: The data from the dashboard should be exportable (e.g., CSV or PDF report generation) so that it can be used in management meetings or further analysis. For example, generating a report of all proposals with their alignment and status for a quarterly portfolio review meeting. This saves manual work assembling such data.\nExample Dashboard Layout: (for illustration) The dashboard might have columns: Request ID, Title, Requester, Department, Submission Date, Status, and Alignment/Category. Each row is a request. At the top or side, filters can narrow the view. Clicking a request opens the full details and activity trail of that request.\nThis level of transparency is a major improvement over the current “black box” tool. It aligns with modern PMO best practices where a centralized intake list gives a holistic view of all proposed work, enabling better-informed decisions and ensuring no valuable idea is lost[10]. Stakeholders across Ochsner will be able to see (at least at a summary level) what initiatives are in the pipeline and how they’re progressing, which can also spur cross-department collaboration (e.g., two similar ideas from different hospitals might be noticed and combined).\n6. Notifications and Communication Features\nEmail Notifications: As mentioned under workflow, the system will send automated emails to relevant parties at key events. For example:\nTo intake admins: “New project request submitted by [Name] – Request #[ID]. Click here to review.”\nTo approvers: “Project Request [ID] is now awaiting your review.”\nTo requesters: “Your project request [ID] status changed to Approved” (with any comments or next steps included).\nTo requesters: “More information requested for your project [ID]. Please log in to update details.” These emails will contain links back to the system for convenience.\nIn-App Messaging: In addition to email, the system will have an in-app comments system or message center. Reviewers and requesters can post comments on a request (for example, an approver might ask a clarifying question: “Have we considered solution X for this?”). The requester would get notified and can reply in the system. This communication thread is stored with the request, creating a transparent dialogue.\nBroadcast Updates: The system could allow administrators to broadcast certain updates, e.g., “Intake process updated: new criteria added for digital projects” or “The intake portal will undergo maintenance on date Y.” This ensures users stay informed about the process itself.\nOpen Communication: By facilitating back-and-forth communication on each request and by notifying outcomes, the tool ensures no one is left wondering about the fate of their idea. This open communication and feedback loop is key to a successful intake process[5] – it keeps proposers engaged and educated on what happens to their ideas, and can provide learning for future submissions (especially if feedback is given on rejected ideas).\nStatus Change Explanations: Whenever a decision is made, the approver will be prompted to include a comment explaining the rationale (even if brief). These explanations are included in the notification to the requester. Over time, this builds understanding among staff on what types of proposals are likely to succeed. For instance, if several proposals are rejected with comments that they lack strategic alignment, employees will learn to ensure alignment in future suggestions.\nReminders and Escalations: The system can send reminder emails if a request has been sitting in a given status too long. For example, if a request is “Under Review” with a certain approver for over 2 weeks, an automated reminder goes to that approver (and maybe CC the PMO lead) saying “Request [ID] has been awaiting your decision for 14 days.” This helps prevent stagnation. Similarly, periodic summary emails to leadership (e.g., weekly digest of all new requests or status changes) can be configured.\nSubscription/Watch Feature: Users (especially leadership or committee members) might be able to “watch” certain requests or categories to get notified of any activity. For example, the CIO could subscribe to all requests marked as “Strategic Initiative” category to see what new ideas are coming in that area.\nIntegration with Collaboration Tools: As a future enhancement, notifications could also be sent to Microsoft Teams or other collaboration platforms used at Ochsner. For instance, a Teams channel for the PMO could receive a message whenever a new request is submitted. This real-time awareness can prompt quicker reviews and discussions.\nBy implementing robust communication features, the intake system not only logs data but also facilitates a conversation around each project idea. This ensures a culture of openness and continuous feedback, which strengthens the overall innovation process.\n7. Reporting and Analytics\nStandard Reports: The system will offer built-in reports to analyze the intake pipeline. Examples of reports:\nSubmission Volume: Number of requests submitted per month (trended over time). This can be used to gauge engagement and seasonality of ideas.\nApproval Rate: How many proposals get approved vs. rejected, possibly broken down by department or strategic category.\nAverage Processing Time: The average time a request spends from submission to final decision. This can highlight if the process is efficient or if there are bottlenecks.\nPortfolio Breakdown: A summary of all requests by status or by strategic alignment (e.g., 40% of proposed initiatives align with “Patient Experience”, 30% with “Operational Efficiency”, etc., perhaps shown as a pie chart).\nBenefits Forecast: Sum of all proposed benefits vs sum of proposed costs for approved projects (showing potential ROI of the pipeline).\nInteractive Dashboard (Analytics View): For PMO and leadership, an analytics section could provide interactive charts. For example, a graph of requests by department, or a timeline view of how projects move through stages. We could leverage a library or tool (like Power BI integration or Chart.js) for this visualization. Real-time analytics means as soon as data changes (a new submission or a decision), the charts update.\nCustom Queries: Advanced users or admins might build custom queries (or filters) and save them as reports. For instance, “Show me all Approved requests in the last 6 months with expected cost &gt; $100k and ROI &lt; 100%” – to identify potentially low-return projects that nonetheless were approved.\nExport to Excel/CSV: All report data should be exportable for offline analysis. Leadership often wants to slice the data in Excel or incorporate it into presentations.\nReporting Permissions: While the request list might be broadly visible, some analytics might be sensitive (e.g., seeing projected costs or ROI might be for leadership eyes only). We will implement permissions such that detailed financial or prioritization reports are accessible only to certain roles.\nBenefits Realization Tracking: Though beyond initial scope, the system could later incorporate tracking of actual outcomes. For example, after a project is executed, the PMO can update the record with actual achieved benefits vs. initial estimates. Reports can then show how accurate proposals were or the realized value. This closes the loop on the intake process, providing a feedback mechanism to improve future estimates (a known best practice is to have a feedback loop to evaluate if projects delivered as promised[11]).\nAudit Reports: The system will also allow auditing the process itself – e.g., list of all requests and who approved them, to ensure proper governance is followed. This is useful for internal audit or compliance reviews.\nDashboard Integration: Some key metrics from the reports can be displayed on the main dashboard (as mentioned before, like counts and simple charts). The full reporting section would allow deeper exploration and slicing/dicing of data.\nWith these analytics, Ochsner’s leadership can gain insights into the innovation pipeline and make data-driven decisions. For example, if the reports show that one strategic goal has dozens of proposals but another goal has few, that might spark discussions about encouraging ideas in under-represented areas. Or if the approval rate is very low in one department, maybe that department needs help formulating better proposals. Essentially, reporting turns the intake data into actionable intelligence, ensuring stakeholders stay up-to-date and can make better decisions, faster.\n8. Integration with Existing Systems\nTo maximize efficiency and eliminate manual work, the new intake system will integrate with several existing systems at Ochsner via APIs or other interfaces:\nSingle Sign-On (SSO) via Azure AD: As noted, the application will integrate with Azure Active Directory for authentication. Users will log in with their Ochsner credentials. This provides a seamless login experience (possibly automatically logged in if they are on the network) and ensures access control is centralized. Additionally, user profile information (name, department, email) can be pulled from AD to auto-populate parts of the request form and to route requests (e.g., knowing the requester’s department might tag the request with that department).\nIntegration with Epic (EHR System): Epic is a core clinical system at Ochsner. While Epic itself might not directly interface with a project intake tool, there are a few integration points to consider:\nThe knowledge base for the intelligent scan can include known Epic modules. We might integrate with Epic’s documentation or module list via an API or static reference to suggest existing Epic capabilities. For instance, if someone requests a feature that Epic provides, the intake system could flag that. In the future, a more advanced integration could query Epic (or an internal registry of Epic features) by keywords.\nIf a project request is related to Epic (e.g., “Implement Epic module X”), we may want to automatically notify the Epic team or link to Epic’s project request process. Possibly, the intake form could have a checkbox “This project involves changes to Epic.” If checked, the system could ensure additional steps (like integration review by the EHR team) are added. This kind of integration ensures that any Epic-related development goes through proper channels.\nData integration: For approved projects that relate to clinical operations, we might push information to Epic’s change management or interface with its development queue, though that might be beyond MVP.\nIntegration with ServiceNow (ITSM/PPM System): Ochsner likely uses ServiceNow (or a similar platform) for IT service management and possibly project portfolio management. Integration here is very valuable:\nProject Creation: When a project request is approved in the intake system, the system can automatically create a corresponding project record or portfolio item in ServiceNow (via REST API). This would carry over all relevant data (title, description, requester, justification, etc.) to avoid re-keying. Essentially, intake would feed the execution pipeline.\nStatus Updates: If ServiceNow is used to track project execution, the intake system might periodically get updates from it for display. For instance, once a project is in ServiceNow and being executed, the intake dashboard could show “Status: In Development (per ServiceNow)” or a link to the ServiceNow project record for more details.\nIncident/Idea Link: If some requests are actually coming via ServiceNow (for example, an employee might put in a ticket that is actually a project idea), we could capture those. However, since we are replacing the intake with our custom app, we might instead encourage all to use the new system and avoid ServiceNow for intake, to maintain the single channel.\nReal-time API calls: The integration will likely use ServiceNow’s available APIs. For MVP, we can implement a simple one-way push on approval. The specifics (like which fields map to ServiceNow fields) will be determined with the ServiceNow administration team.\nAnalytics and Data Warehouse: The data from the intake system (requests, decisions, timestamps, etc.) could be fed into Ochsner’s enterprise data warehouse or analytics tools for broader analysis. We could implement an API or nightly data export that sends intake data to the analytics team. This might enable combining intake data with other organizational data (for example, correlating number of project ideas with certain business outcomes).\nAlternatively, if Ochsner uses Power BI or another BI tool, we can directly connect the intake database to those tools for live reporting.\nEmail/Calendar Integration: Using Microsoft Graph API (for Exchange/Outlook), the system could integrate with calendars. For example, when a request is approved and needs a kickoff meeting, the system might help schedule it. Or, it could place tasks on approvers’ Outlook tasks list for requests they need to review. These are nice-to-have features to ensure the process integrates with how people work day-to-day (in Outlook, etc.).\nEnterprise Portal Integration: If Ochsner has an intranet or employee portal, the intake system should be linked there (so users can find it easily). Possibly, a widget on the intranet homepage could show “Have an idea? Submit to the Project Intake System” with a link.\nAPIs for Extensibility: We will design the intake system itself with an API-first approach. All core functionalities (submit request, update request, get status, etc.) will have API endpoints. This allows future integration or even use of the engine by other interfaces. For instance, perhaps someday someone wants to submit a request via a chatbot or another tool – they could use the API. Or if Ochsner adopts a new PPM tool, it could pull intake data via API. By having a robust REST API for the intake system, we ensure it can plug into the broader IT ecosystem easily.\nAuthentication and Security for Integrations: All integration points will use secure methods (OAuth2 for APIs where possible, secured tokens, etc.) aligned with Ochsner IT security policies. For example, the ServiceNow integration will use a service account with appropriate permissions to create records, and communication will be over HTTPS with certificate validation.\nTesting Integrations: We will set up test scenarios to ensure these integrations work properly (e.g., when an idea is approved, does it appear correctly in ServiceNow within a few minutes?). Also, if an integration fails (e.g., ServiceNow API is down), the system should log the error and notify an admin to retry or handle manually, ensuring no approved request is lost.\nBy integrating with Epic and ServiceNow, and other systems, the intake tool becomes part of a cohesive workflow from ideation to implementation. This not only saves effort (no re-entering data) but also accelerates time-to-value since approved ideas can quickly transition to active projects. It also helps with governance – keeping everything connected and traceable. In short, the new system will not operate in a silo, but rather complement and enhance Ochsner’s existing IT landscape.\nUser Roles and Workflow\nSeveral user roles will interact with the intake system, each with specific capabilities:\nRequester (Employee submitting idea): Any Ochsner employee or staff member who has an idea or vendor request. They can access the intake form (via SSO), submit new requests, save drafts, and view the status of their own submissions along with any feedback.\nIntake Administrator/Coordinator (PMO analyst): Members of the PMO or IT governance team who oversee the intake process. They have access to all submissions, can edit or add notes, perform initial triage, combine duplicates, and manage the categorization of requests. They can also configure certain system settings (like form fields, dropdown options, etc., if an admin UI is provided).\nReviewer/Approver (Leadership or Committee members): Individuals who are authorized to approve or reject requests. This might include IT leadership (like CIO, CDO), business unit leaders, a formal Intake Committee, or subject matter experts for certain domains. They will be assigned requests (or can pick up requests in their queue) to review after PMO triage. They can view all details and then input a decision with comments.\nExecutive Stakeholder (View-only): Some executives might not actively approve each request but still want visibility. They could have a view of the dashboard to monitor intake trends and statuses, without participating in every decision.\nIT Developer (for system maintenance): Not an end-user of the intake process, but responsible for maintaining the application. They would ensure integrations are functioning, update the software, and possibly manage user permissions. (This role is more about system operations.)\nWorkflow Steps: The end-to-end process for a project intake request will typically follow these steps (with roles involved at each stage):\nIdea Submission (Requester): An employee fills out and submits the project intake form in the system. They provide all required information about their idea. Upon submission, they receive a confirmation and can see their request listed in their dashboard as “Submitted” status.\nInitial Triage (Intake Coordinator): The PMO intake admin gets notified of the new request. They review the submission for completeness and assign a category or preliminary priority if needed. At this stage, the coordinator might do an initial internal scan – checking for duplicates or obvious existing solutions. If they find that the request is a duplicate or already answered by an existing system, they can reach out to the requester (via the system’s comment feature) or mark the request with a note. The coordinator then sets the request status to “Under Review” and assigns it to the appropriate Approver/committee queue.\nReview &amp; Evaluation (Approver/Committee): The designated reviewers are notified. They will log in and examine the request details. They will evaluate the proposal based on criteria like strategic fit, expected ROI, cost, urgency, etc. (Possibly aided by a scorecard in the system – an enhancement could be that reviewers can input scores for value, risk, etc., which the system averages or sums up to suggest a priority score. This is a potential feature to help prioritize based on business value and ROI). The reviewers can discuss via the comments if needed or hold a meeting (outside the system) but record the outcome in the system.\nDecision (Approver): The approver enters their decision in the system:\nIf Approved, they select “Approve” in the system. They might also choose an “approval type” (e.g., approved to proceed to scoping, or approved but put in backlog). They enter any comment and submit. The system updates the status to “Approved” (or a more specific status like “Approved – To Be Scheduled”).\nIf Rejected, they select “Reject” and must provide a reason (feedback). Status updates to “Rejected”.\nIf Deferred or Need More Info, they select a “Hold” or “More Info Required” option. In this case, they would detail what is needed (“e.g., please provide a detailed cost estimate” or “clarify how this differs from project X”). The system sets status accordingly.\nFeedback &amp; Resubmission (Requester/Coordinator): If more information was requested, the requester (or the intake coordinator on their behalf) can update the submission. The system allows editing certain fields or adding an addendum. Once updated, the request can be resubmitted into the review cycle. (The history will show that it was revised).\nTransition to Execution (Coordinator/Project Manager): For approved projects, the PMO or relevant execution team is alerted. Here, integration kicks in: the system might automatically create a project entry in ServiceNow or another PPM tool. The status in the intake system might change to “Approved – In Execution” once the project formally starts. The requester is informed that their idea was approved and is now being worked on (or scheduled). A project manager might be assigned at this point (possibly recorded in the intake system or in the external PPM and reflected back).\nClosure &amp; Post-Analysis: After a decision (approve or reject), the request is essentially closed in terms of intake. However, it remains in the system for records. If a project was executed, later the PMO can mark the intake request as “Delivered” or “Completed” and even attach outcome results (like “delivered in Q3 2026, achieved 95% of anticipated benefits”). This step is part of establishing a feedback loop to measure if the intake decisions yielded value, as few organizations currently do benefit analysis but it’s very important[12]. This data can help improve future decision-making.\nThroughout these steps, the system ensures that all stakeholders are kept in the loop – requesters can see when their idea moves stages, approvers have all info to decide, and leadership can see the overall flow. The process is standardized and documented, which contrasts with the previous ad-hoc or opaque method.\nFor example, consider a user story: Dr. Smith submits a request for a new telehealth scheduling tool. He fills out the form, linking it to the strategic goal of “Digital Health Expansion” and estimating it could increase patient visits by 10% (value) for a cost of $50k. He submits; the PMO coordinator Jane reviews it, notices there was a similar idea last year. She links that prior request in a comment. The request goes to the Digital Health committee; they see Dr. Smith’s justification and Jane’s note about the previous idea (which was put on hold due to budget). They discuss and decide to approve Dr. Smith’s proposal since the need is still valid and now higher priority. They click “Approve”, add comment “Approved – align with Digital Medicine program, high potential ROI”. Dr. Smith gets an email notification that his idea is approved, with the comment. A project is created in ServiceNow for the Telehealth Scheduling Tool, and a project manager is assigned. Dr. Smith can follow the progress via that project link. Three months later, that project is delivered. The intake request is marked Completed, and PMO notes that indeed patient visits increased as expected. This entire lifecycle is traceable in one system.\nTechnical Architecture and Platform\nThe Project Intake System will be developed as a cloud-hosted web application, aligning with Ochsner’s IT standards (which include heavy use of Microsoft Azure services). The architecture will emphasize scalability, security, and maintainability:\nApplication Stack: We propose using a modern web application framework. Given Ochsner’s ecosystem, a .NET 6+ (ASP.NET Core) web application is a strong option for the back-end, with a React or Angular front-end for a dynamic user experience. .NET is enterprise-proven and likely aligns with Ochsner’s existing skill sets and Azure integration. Alternatively, a full-stack JavaScript solution (Node.js + React) could be considered if that better fits the team’s expertise. The key is to use a framework that allows rapid development of forms, workflow, and integrates well with Azure services.\nHosting: The app will be hosted in Azure, possibly using Azure App Service for the web application and Azure SQL Database for the data store. Azure App Service provides easy scalability and managed hosting for web apps. We will have separate environments for development, testing, and production deployment to ensure reliability.\nDatabase: A relational database (SQL) will store the core data: requests and all their fields, user info (or references to AD IDs), status logs, comments, etc. A structured schema ensures we can query and report easily (e.g., using SQL for the reports). Azure SQL is a natural choice, or if using .NET, Entity Framework can handle ORM. We will design the schema to accommodate evolving fields (perhaps a flexible key-value store for additional custom fields, or just plan schema migrations as needed).\nAPIs: The server back-end will expose a set of RESTful APIs that the front-end uses. This includes endpoints for: authenticating (or rather, establishing session via SSO), submitting a request, fetching current user’s requests, admin fetching all requests, updating status, posting comments, etc. These APIs will also be used for integration (e.g., called by ServiceNow or by a bot if needed). JSON will be the data format. We will secure these APIs with proper authentication (JWT tokens from Azure AD, for example).\nAuthentication &amp; Authorization: We will integrate Azure Active Directory for SSO. Technically, this means using OAuth2/OIDC flows. The front-end will redirect to Ochsner’s login page, and upon login, a token is issued that the app trusts (we’ll register the app in Azure AD). We will use AD groups or roles to manage authorization (e.g., members of a certain AD group are Intake Approvers, others are just submitters). The app will enforce role-based access control in the UI and APIs – for instance, only users with the “Approver” role can call the approve/reject endpoint.\nUser Interface: The front-end will be built for responsiveness (so it works on desktop and mobile). Using a component library (like Fluent UI or Material UI) can ensure a consistent and accessible design. We will incorporate Ochsner branding (logo, colors) to give it a polished, official look. Client-side scripting will provide a smooth user experience (e.g., dynamic form sections, instant form validation feedback, search-as-you-type for duplicates, etc.). Where possible, we’ll use AJAX calls to make the experience seamless (no full page reloads needed).\nWorkflow Engine: We can implement the workflow logic in code (for MVP, simple if/else logic as per rules defined). If down the line the process becomes more complex, we might integrate a workflow/BPM engine or a state machine library. But initially, statuses and transitions are manageable within our application code. Status values (New, Under Review, Approved, etc.) will be enumerated and we’ll allow certain transitions when triggered by certain roles. This logic will be thoroughly tested to avoid invalid state changes.\nIntegration Implementation:\nServiceNow: Use ServiceNow’s REST API. This requires credentials (service account) and perhaps a minor development on the ServiceNow side to expose an endpoint for project creation if not already available. From our app, when a request is approved, we send an HTTPS POST to ServiceNow with a JSON payload of the project data. We’ll handle the response (ensuring it was created, capturing the new SN project ID, etc.). If the API call fails, we log it for retry.\nEpic: Direct integration is trickier. Epic does have APIs (FHIR endpoints) but those are mostly clinical data oriented, not really for “checking if Epic has a module X.” Instead, our approach is to maintain a reference list. We might connect to an internal service or database where the EHR team lists known Epic capabilities. If available, we could query that. Otherwise, Epic integration might be limited to including Epic stakeholders in the review loop rather than an automated API call. We might revisit this after initial rollout.\nEmail: We will use an email service to send notifications. Azure offers SendGrid or we can use O365 SMTP relay. Email templates will be created for each notification type. The system will trigger these on events.\nTeams/Chat: Possibly use Microsoft Graph API to post messages to Teams channels if desired. This can be configured later.\nReal-Time Updates: To give a real-time feel (e.g., if an admin approves a request while the requester’s dashboard is open, it updates), we might use WebSocket or SignalR to push updates to clients. This is not essential, but a nice touch. Otherwise, periodic auto-refresh or requiring user to refresh is simpler.\nScalability: With ~200 requests per month (as estimated), the load on the system is modest. Concurrent users might be in the tens, not thousands. So a single App Service instance and database will handle it easily. However, since it’s on Azure, we can scale out/in if needed. We should design statelessness in the app server (which is standard with ASP.NET Core) so that multiple instances can run behind a load balancer if needed. For storage scalability, Azure SQL at that volume is fine (and can scale DTUs as needed). We’ll also consider using Azure Cache (Redis) if there is any need to cache frequent reads (perhaps for the dashboard queries if heavy).\nSecurity and Compliance: Security is paramount, especially in a healthcare environment. While the intake data isn’t patient data, it could still be sensitive (it contains internal plans, possibly vendor info, etc.). We will ensure:\nAll traffic is over HTTPS with TLS 1.2+ encryption.\nData at rest in the database is encrypted (Azure SQL does this by default).\nProper authorization checks on every API (to ensure one user cannot fetch or modify another’s requests unless authorized).\nPenetration testing will be conducted on the app (common OWASP vulnerabilities like SQL injection, XSS, CSRF will be mitigated). We’ll use parameterized queries or an ORM to avoid SQL injection, output encoding to avoid XSS, and anti-forgery tokens for forms.\nLogging and monitoring will be set up (Azure Application Insights) to track usage and detect any unusual activities.\nThe system will comply with internal IT policies and any regulatory needs. Likely, since no PHI is involved, HIPAA compliance is not a direct concern, but we will still treat the data as internal confidential.\nBackups: Regular backups of the database will be configured (point-in-time restore capability) to prevent data loss. The infrastructure will be set up across at least two Azure regions or availability zones for disaster recovery (if one data center goes down, the app can failover).\nMaintainability: The codebase will be documented and source-controlled (e.g., in Azure DevOps or GitHub enterprise). We will set up a CI/CD pipeline for automated deployments to ensure new features or fixes can be rolled out quickly (important since we anticipate iterative improvements). Configuration (like integration endpoints, email settings, etc.) will be externalized (e.g., in Azure Key Vault or app settings) so that changes can be made without code edits.\nExtensibility: The architecture should allow adding new fields or features without major refactoring. For example, if next year Ochsner wants to add a field “Environmental Impact” to the intake form, we can add it to the form, database, and it will flow through. Using a modular design and perhaps form metadata can help. Also, if later on they want to incorporate AI (like an AI assistant to help fill the form or to evaluate proposals), we can integrate that thanks to the API-centric design.\nIn summary, the technical architecture leverages Azure’s reliable cloud platform, integrates with enterprise identity (SSO), and is built with scalable web tech. It’s a straightforward web app at its core – which is beneficial because it’s well within the team’s capability to deliver quickly. We are avoiding overly complex or bleeding-edge tech for this project, focusing instead on robustness and alignment with Ochsner’s environment. The design ensures that as Ochsner’s needs grow (more users, additional features, integrations), the system can grow with it.\nNon-Functional Requirements\nBeyond the core features, the system must meet several non-functional requirements (NFRs) to be successful:\nUsability &amp; Accessibility: The intake application must be very easy to use, even for non-technical staff. The UI should follow UX best practices and Ochsner’s style guides. It should also be accessible (WCAG 2.1 AA compliance) so that it can be used by staff with disabilities. Given that a major issue with the current system is poor usability, this is a top priority. We will conduct user testing with a few end-users to gather feedback on form design and clarity. If the intake process or tool is too complicated, people will perceive it as an obstacle and avoid it[1], so we will strive for simplicity without sacrificing necessary information.\nPerformance: The system should be responsive. Form interactions and page loads should happen in a few seconds at most. Given the scale (a few hundred requests per month), heavy load is not an issue, but the app should handle bursts of traffic gracefully (e.g., if after a town hall meeting, 50 users all log ideas the same day). The database and server will be sized to easily handle concurrent usage (targeting support for at least 100 concurrent users with no degradation, which is well above expected). Complex operations (like generating reports) should be optimized (maybe run in background or use database indexes effectively) to avoid slowdowns.\nScalability: While current usage is moderate, the design should allow scaling up (vertical) or out (horizontal) if needed. For instance, if in the future the intake system is also opened to affiliate hospitals or more use cases (like idea crowdsourcing from hundreds of clinics), we should be able to accommodate by adjusting infrastructure, not rewriting the app. Azure makes this straightforward, but our design (stateless web tiers, etc.) ensures it’s possible.\nReliability and Uptime: The system will be an important internal tool, though minor downtime is not life-or-death (unlike a clinical system). Still, we aim for high availability. Using Azure’s services, we will target at least 99.5% uptime (which translates to less than ~4 hours of downtime per month). This will be achieved via redundant instances and possibly multi-region deployment. We’ll schedule any maintenance or updates during off-hours and communicate those in advance.\nData Retention and Archiving: All intake submissions and their outcomes should be stored for future reference. We expect to retain this data for several years at minimum (to analyze trends over time). We will implement archiving rules if needed (for example, close out and archive requests older than 5 years to a separate storage, if database grows too large). But given the data volume (even 200 requests/month is 2400 a year; in 5 years 12k records – which is nothing a SQL DB can’t handle), we can keep data online for a long time. It’s more likely we archive based on relevance (like projects that were rejected 10 years ago may be purged or moved).\nConfidentiality and Privacy: The content in project requests might occasionally include sensitive information (e.g., mentioning vendor pricing, or referencing internal process issues). We will classify this data as internal confidential. Appropriate measures like access control (only authenticated users can see, and only authorized can see all data) are in place. We will also include a disclaimer or notice to users not to include any patient-identifiable information in submissions, since it’s not needed for project proposals and we want to avoid inadvertently handling PHI in this system.\nCompliance and Audit: The system should comply with any auditing requirements of Ochsner’s IT. This means an admin can produce logs of who accessed what, and any changes. The design already logs an audit trail of request actions. If needed, we can integrate with Ochsner’s SIEM (Security Information and Event Management) to forward logs for centralized monitoring (for example, any admin access or mass export of data could be flagged).\nMaintainability: The code will be modular and documented. The system will likely live for many years, so it should be easy for future developers to maintain. We’ll provide an admin manual (for PMO) and technical documentation (for IT). Configuration changes (like updating strategic goal options, or tweaking email templates) should be possible without code changes – either through an admin UI or config files – to reduce the need for developer intervention in simple updates.\nExtensibility: The scope of this system could expand (maybe to intake other kinds of requests like capital expenditures or research proposals). We should design it in a way where adding new categories or slightly different forms is possible. Perhaps our data model can accommodate custom fields or we allow multiple intake “forms” if needed. While not a requirement now, designing with a bit of foresight could save time later.\nResponse to Feedback: After deployment, users might suggest improvements (e.g., “It would be nice if the form had a field for X” or “Can we integrate with SharePoint to attach files from there?”). We consider the initial launch as an MVP that we will iterate on. Non-functional in this sense is agility: we will set up a process to gather user feedback and roll out enhancements continuously. This will ensure the tool remains aligned with user needs and organizational priorities (since priorities can change, the tool must evolve too[7]).\nCost Efficiency: Since we’re decommissioning an expensive tool, we must ensure our solution is cost-effective. Using Azure services, we will monitor the monthly operational cost (App Service, DB, etc.). We aim to keep it minimal – likely just a few hundred dollars a month at most for the infrastructure, which is trivial compared to the presumably high licensing cost of ProcessUnity (which might be on the order of thousands per month). This will deliver immediate cost savings. If the system usage grows, costs might increase, but by then it would be justified by value, and still likely far less than enterprise SaaS licensing for intake.\nTesting: Prior to launch, the system will undergo thorough testing: unit testing of components, integration testing (especially for the workflow and external integrations), and user acceptance testing with a pilot group of end-users. We will also test edge cases (e.g., very large text inputs, or what if an approver goes on vacation – can someone else take over their requests, etc.). A staging environment will mirror production for this testing.\nDeployment and Rollback: We will have a robust deployment strategy (perhaps blue-green or canary releases in Azure) so we can deploy updates with minimal downtime and ability to rollback if an issue is discovered. This ensures even after go-live, the system can be updated reliably.\nBy meeting these non-functional requirements, we ensure that the Project Intake System not only has the needed features but also delivers them in a reliable, secure, and user-pleasing manner. The system’s success will be measured not just by functionality, but by adoption (users actually using it vs. circumventing it) and by improved outcomes (e.g., shorter intake cycle times, better project success rates). Those outcomes are only possible if the system is performant, easy, and trustworthy.\nImplementation Plan and Timeline\nDeveloping and rolling out this new intake system will be approached in phases:\nPhase 1: Analysis and Design (Current) – We have gathered requirements (business and technical) and are formalizing the specification (this document). This phase also involves securing stakeholder buy-in (which we have from Adam and likely from IT leadership given the pain points). At the end of this phase, we have a clear scope and design for the system.\nPhase 2: MVP Development (Months 1-2) – Build the core features: the submission form, basic workflow (single-stage approval), personal dashboard, and admin list. Integrate SSO for login. We will also implement at least one key integration (likely the ServiceNow project creation) in this phase, as it’s straightforward and demonstrates value. The intelligent scan feature can be stubbed or kept simple (maybe just a manual checklist for the coordinator). We will use synthetic or sample data to test the system internally. By the end of Month 2, we aim to have a working prototype that can be demoed to stakeholders (targeting a demo by January as requested).\nPhase 3: Testing and Pilot (Month 3) – Conduct thorough testing with a small group of users (e.g., a few employees and a few approvers from one department). Gather feedback on the form usability and workflow. Make iterative improvements – for example, if testers find a field confusing, adjust the label or help text. Also test integrations in a staging environment (maybe with ServiceNow sandbox, etc.). Address any security testing findings. During this phase, we also prepare training materials or quick reference guides for broader rollout.\nPhase 4: Go-Live (Month 4) – Launch the system across Ochsner (all 48 hospitals and units). This involves communications to all staff about the new process (possibly coordinated with leadership announcements like “We have a new intake portal, effective now all project/vendor ideas should go through it”). We’ll deprecate ProcessUnity by transferring any in-flight requests from it into the new system (this might be done manually if volume is low, or via data import if feasible). The go-live will likely be gradual – perhaps first open it to corporate departments, then to clinical departments, etc., to ensure support is available.\nPhase 5: Post-Live Enhancements (Month 5 onward) – After initial rollout, we will focus on the intelligent features and additional improvements:\nEnhance the internal/market scan intelligence (possibly integrate a simple AI service or expand the knowledge base).\nAdd more advanced reporting and possibly a scoring/prioritization module (if leadership wants to rank projects by value).\nIntegrate with any other systems identified (for example, if Ochsner has a strategic portfolio dashboard, feed our data there).\nIncorporate a feedback loop for completed projects (tie back actual performance).\nGeneral refinements: UI tweaks, performance optimizations, etc.\nWe will use Agile methodology to deliver this project, likely in 2-week sprints. This means stakeholders (like Adam and representatives of requesters and approvers) can see incremental progress and provide input continuously. The tight timeline to have a demo by January is feasible because we are focusing on core features first and using known technology. In fact, much of the functionality (form, CRUD operations, simple workflow) is standard web development fare – we’re not inventing new algorithms but rather implementing best practices with customization.\nRisk Mitigation: Potential risks and how we address them: - User Resistance: Some employees might be used to emailing ideas or using the old tool. We mitigate by making the new tool clearly superior (ease of use) and by getting leadership endorsement to mandate its use. Training sessions or short videos can help introduce it. - Scope Creep: The wish list for an intake system can be endless. We will keep the initial scope focused. Extra features (like full AI analysis or deep resource planning integration) will be noted for future phases. Stakeholders are aligned that basic functionality and usability come first. - Integration Challenges: The ServiceNow integration requires coordination with another team. We’ll engage them early (if not already) to ensure API access. If that integration is delayed, it doesn’t break our core system – we can always output a report for PMO to manually create projects as a stopgap. Similarly, Epic integration is not critical path; it’s a bonus feature for later. - Data Migration: If we need to pull existing records from ProcessUnity, we’ll do so carefully. This might involve exporting to Excel and then importing into our DB. Ensuring no loss of historical data might be important to PMO. We plan for a one-time import if needed. - Security Concerns: Being a new internal app, IT security will review it. We will work closely with them to pass any audits (fortunately using SSO and Azure means much is standard). We allow ample time for security testing in Phase 3. - Timeline Crunch: If unforeseen issues arise and MVP isn’t ready by January for demo, we will have a backup demo using a partial prototype or even a slideware simulation (but given our confidence, we aim for a real prototype). The idea is to show leadership a clickable, working system to build confidence. We can prioritize demo-critical features (submission, tracking, a dummy dashboard) first.\nExpected Benefits and Value Proposition\nImplementing the custom Project Intake System will yield significant benefits for Ochsner Health:\nCost Savings: First and foremost, replacing ProcessUnity will eliminate its licensing and maintenance costs. If that tool costs, for instance, \\$X per year in licenses (plus any admin overhead), the new system will largely eliminate that expense after only the initial development effort. Ochsner can reallocate those funds to more mission-critical initiatives. Over a few years, this could amount to hundreds of thousands of dollars saved, directly improving the IT budget’s bottom line.\nHigher Engagement and More Ideas: With a user-friendly submission process, employees will be far more likely to actually use the system to propose innovations. We anticipate an increase in the number of project ideas submitted, especially from front-line staff who might have avoided the old system. This taps into the creativity of the workforce – more ideas mean a greater chance of discovering high-value opportunities. It fosters a culture of innovation, as people see that suggesting improvements is easy and welcomed (and that their ideas won’t disappear into a void).\nBetter Project Proposals (Quality): The structured form and guidance will lead to more complete and thought-out proposals. By requiring strategic alignment and value estimation, requesters must do some homework and critical thinking. This means leadership will be evaluating proposals that have clearer justification and context. The days of one-liner requests with no rationale will be gone. As a result, the approval decisions will be based on solid information, which in turn will yield higher success rates for projects (because the ones approved have clear value and alignment). Industry best practices affirm that an intake process that aligns projects with strategy and focuses on value leads to choosing higher-impact projects and filtering out low-value ones[13][7].\nStrategic Alignment and Portfolio Value: Because each request is linked to strategic objectives and measured by value, the portfolio of approved projects will inherently be more aligned to Ochsner’s strategic goals. Leadership can confidently say “we are investing in the right things.” The intake system becomes a tool for strategy execution – ensuring every new project is contributing to the organization’s objectives or it doesn’t get done. This alignment prevents wasted effort on projects that don’t move the needle on Ochsner’s key goals. As one reference puts it, optimized intake reduces portfolio waste on low-value projects and gives primacy to the highest value requests[14][15].\nImproved Transparency and Accountability: The single, centralized pipeline of requests provides visibility at all levels. Leadership gains oversight of all incoming demand in one place (no more surprises or shadow projects). Departments can see where their requests stand and that everything is being handled via a fair process. This transparency builds trust: employees trust that if they submit an idea, it will actually be reviewed and not vanish; executives trust that projects under consideration are going through due process. It also holds everyone accountable – e.g., if an approver is sitting on many requests without action, that’s visible and can be addressed. In modern portfolio management, having one transparent intake channel eliminates confusion and off-the-grid initiatives[10], which is exactly what Ochsner will achieve.\nFaster Time to Value: A more efficient intake process means good ideas get to execution faster. By reducing bottlenecks (like not knowing who should approve or losing track of requests), we shorten the cycle from idea to project start. This agility is crucial in healthcare where improvements (like a new digital tool or process change) can directly benefit patient care or operations sooner. Additionally, by integrating with project execution tools, we cut out administrative lag (no retyping info into another system). The references highlight that optimizing intake can decrease time to value and improve efficiency[3] – Ochsner can expect to realize the benefits of approved projects sooner.\nData-Driven Decision Making: With the analytics and reports, Ochsner’s leadership will have data on the innovation pipeline. They can spot trends (e.g., many requests coming to improve digital front door experience – maybe invest more there) or identify gaps (e.g., no requests in a strategic area – maybe communicate focus or encourage ideas there). They can also monitor the ROI projections of upcoming projects and post-project outcomes to continuously refine their investment strategy. This moves decision making from anecdotal or whoever’s loudest, to objective criteria. In essence, the intake tool becomes a decision support system, not just a data collection form.\nEnhanced Cross-Department Collaboration: With a centralized system, different departments can see each other’s ideas (at least those that are not confidential). This can spark collaboration – e.g., the cardiology department sees that primary care proposed a telemedicine follow-up project; they might reach out to join forces if they had a similar need. By breaking down silos of proposal information, the organization can unify efforts and avoid duplicate work. Everyone working off the same list helps ensure resources aren’t unknowingly competing or duplicating. This supports enterprise-wide optimization rather than local sub-optimal projects.\nGovernance and Compliance: The new system inherently enforces a governance structure. This reduces the risk of projects being executed without proper approval or projects bypassing IT oversight (which could lead to rogue IT spend or compliance issues). Every initiative will have a documented approval trail. If an audit or inquiry happens (“Why was Project X initiated? Who approved this vendor?”), the answers are readily available. Also, by involving necessary groups like IT Security or Legal during the intake (e.g., maybe certain questions trigger a security review), the organization stays compliant with internal policies (for instance, ensuring all vendor software is vetted). It’s easier to manage risk when the process is formalized.\nEmployee Satisfaction and Morale: For employees, being able to submit their ideas and see them progress is empowering. It gives them a voice in organizational improvement. Even if an idea is not approved, the fact that they got feedback (“this doesn’t align right now because…”) is a learning opportunity and shows respect for their input. This can improve morale and engagement, as employees feel heard and part of the innovation process. It fosters a continuous improvement culture.\nShowcasing IT Innovation: Internally, delivering this system demonstrates that the IT/digital team can respond quickly to internal needs with custom solutions. It’s a relatively fast win that will build credibility. For the CIO and CDO, this project is a tangible example of improving IT operations and governance. It shows a commitment to best practices and could even be something they highlight in performance reviews or board meetings (modernizing internal processes to be best-in-class). It transforms a pain point into a showcase of efficiency.\nScalability to Other Uses: Once this platform is in place, Ochsner can potentially extend it to other intake processes – e.g., capital expenditure requests, marketing campaign requests, or even external partner project requests. The flexible foundation means additional forms or workflows could be added, leveraging the same framework. This consolidates tools (no need to buy another product for each type of request) and further saves costs. Essentially, we’re building an “intake engine” that could handle multiple use cases in the future.\nMeasurable Outcomes: We will be able to measure the impact of this new system. Some KPIs to track:\nIncrease in number of ideas submitted (quarterly) – indicating higher engagement.\nDecrease in average time from submission to decision – indicating efficiency.\nPercentage of projects approved that meet or exceed their predicted benefits – indicating better initial scoping (though this is longer-term to measure).\nUser satisfaction survey results for the intake process – expecting a jump once new tool is in use versus baseline dissatisfaction currently.\nWe expect positive movement in all these areas, confirming the value.\nFrom leadership’s perspective, the ROI of this project is very high. The investment is the development effort (which, for an internal team, is mainly opportunity cost and a bit of infrastructure cost). The returns include direct cost savings (tool elimination) and more importantly, improved portfolio outcomes that can save or generate millions. For example, avoiding a single ill-conceived project (that might have wasted \\$500k) or capturing a great idea (that generates \\$1M in revenue) far outweighs the cost of building this system. By instituting discipline in intake, Ochsner will approve only the right projects – those aligned with strategy and capacity – and say no to projects that don’t meet the bar[15], ultimately ensuring that resources are invested in initiatives with the highest impact on patient care and organizational success.\nIn summary, the new Project Intake System will transform a weak link in Ochsner’s innovation pipeline into a strength. It delivers financial savings, better decision-making, and a more innovative culture. It directly addresses the pain points of both users and leadership. By having this custom, intelligent intake process, Ochsner can accelerate innovation and stay ahead in the rapidly evolving healthcare landscape, making sure every project it undertakes truly advances its mission and strategic goals. The value proposition is not just about fixing a tool – it’s about enabling Ochsner to make smarter investments and ultimately provide better healthcare services through the right projects.\n[1] [2] [3] [4] [7] [8] [9] [11] [12] [13] 7 Ways to Improve Your Project Intake Process\nhttps://regoconsulting.com/7-ways-to-improve-your-project-intake-process/\n[5] [6] What is a Project Intake Process &amp; Steps to Improve it\nhttps://www.saviom.com/blog/intake-process/\n[10] [14] [15] Optimize IT Project Intake, Approval, and Prioritization | Info-Tech Research Group\nhttps://www.infotech.com/research/ss/optimize-it-project-intake-approval-and-prioritization",
      "targetPlatform": "web",
      "deployment": {
        "provider": "aws",
        "region": "us-east-1",
        "environment": "dev"
      }
    },
    "status": "completed",
    "progress": 0,
    "projectDirectory": "/Users/rfitzgerald/Coding/ai-projects/2f490492-cc7f-41bb-8081-7056289f66ed",
    "createdAt": "2026-01-06T22:00:36.589Z",
    "updatedAt": "2025-12-31T04:12:12.552Z",
    "buildType": "complex"
  },
  {
    "projectId": "white-glove-website-mk4qg8r0",
    "requirements": "",
    "config": {
      "name": "White Glove Website",
      "description": "",
      "techStack": [
        "next.js",
        "typescript",
        "tailwind"
      ]
    },
    "status": "idle",
    "progress": 0,
    "createdAt": "2026-01-08T00:52:29.391Z",
    "updatedAt": "2026-01-08T00:52:29.391Z",
    "buildType": "complex"
  },
  {
    "projectId": "7a681c3f-67a1-4fdd-9162-f1a54b62bccc",
    "requirements": "Project cloned from https://github.com/dkoi3d-personal/weight-management.git",
    "config": {
      "name": "Weight Management Mobile"
    },
    "status": "completed",
    "progress": 100,
    "projectDirectory": "/Users/rfitzgerald/Coding/ai-projects/7a681c3f-67a1-4fdd-9162-f1a54b62bccc",
    "source": "github",
    "gitUrl": "https://github.com/dkoi3d-personal/weight-management.git",
    "createdAt": "2026-01-08T16:11:32.710Z",
    "updatedAt": "2026-01-08T16:24:21.264Z",
    "buildType": "complex"
  },
  {
    "projectId": "qb-1767894090159-49nlf3",
    "requirements": "Create a healthcare application called \"Patient Dashboard\". Use Epic FHIR APIs: Allergies, Patient Demographics, Medications, Vital Signs. Generate these components: AllergyList, AllergyBadge, AllergySeverityIcon, PatientBanner, PatientCard, PatientSearch, PatientDemographics, MedicationList, MedicationCard, HighRiskMedicationAlert, DrugInteractionWarning, VitalSignsChart, VitalSignsCard, BloodPressureDisplay. Generate these hooks: useAllergies, usePatient, usePatientSearch, useMedications, useVitalSigns. Include features: demographics, vitals, medications, allergies.",
    "config": {
      "name": "Create a healthcare applicatio...",
      "description": "Create a healthcare application called \"Patient Dashboard\". Use Epic FHIR APIs: Allergies, Patient D",
      "techStack": [
        "next.js",
        "typescript",
        "tailwind"
      ],
      "requirements": "Create a healthcare application called \"Patient Dashboard\". Use Epic FHIR APIs: Allergies, Patient Demographics, Medications, Vital Signs. Generate these components: AllergyList, AllergyBadge, AllergySeverityIcon, PatientBanner, PatientCard, PatientSearch, PatientDemographics, MedicationList, MedicationCard, HighRiskMedicationAlert, DrugInteractionWarning, VitalSignsChart, VitalSignsCard, BloodPressureDisplay. Generate these hooks: useAllergies, usePatient, usePatientSearch, useMedications, useVitalSigns. Include features: demographics, vitals, medications, allergies.",
      "targetPlatform": "web",
      "deployment": {
        "provider": "aws",
        "region": "us-east-1",
        "environment": "dev"
      }
    },
    "status": "idle",
    "progress": 0,
    "projectDirectory": "/Users/rfitzgerald/Coding/ai-projects/qb-1767894090159-49nlf3",
    "createdAt": "2026-01-08T17:41:50.514Z",
    "updatedAt": "2026-01-08T17:41:50.514Z",
    "buildType": "quick"
  },
  {
    "projectId": "quote-bind-mkd01b72",
    "requirements": "",
    "config": {
      "name": "Quote/Bind",
      "description": "",
      "techStack": [
        "next.js",
        "typescript",
        "tailwind"
      ]
    },
    "status": "idle",
    "progress": 0,
    "createdAt": "2026-01-13T19:42:58.290Z",
    "updatedAt": "2026-01-13T19:42:58.290Z",
    "buildType": "complex"
  },
  {
    "projectId": "test-1-mkd60c9j",
    "requirements": "",
    "config": {
      "name": "Test 1",
      "description": "",
      "techStack": [
        "next.js",
        "typescript",
        "tailwind"
      ]
    },
    "status": "idle",
    "progress": 0,
    "createdAt": "2026-01-13T22:30:10.725Z",
    "updatedAt": "2026-01-13T22:30:10.725Z",
    "buildType": "complex"
  },
  {
    "projectId": "asfasdfasdf-mkd65gcx",
    "requirements": "",
    "config": {
      "name": "asfasdfasdf",
      "description": "",
      "techStack": [
        "next.js",
        "typescript",
        "tailwind"
      ]
    },
    "status": "idle",
    "progress": 0,
    "createdAt": "2026-01-13T22:34:09.308Z",
    "updatedAt": "2026-01-13T22:34:09.308Z",
    "buildType": "complex"
  }
]